<h1>L&auml;ge anpassning</h1>

<p>Om Du v&auml;ljer 'Ja' f&ouml;r det h&auml;r alternativet d&aring; kommer studenten/eleven/deltagaren/den l&auml;rande att kunna l&auml;mna flera svar p&aring; en fr&aring;ga t.o.m. inom samma f&ouml;rs&ouml;k p&aring; testet. S&aring; om svaret t.ex. &auml;r markerat som felaktigt s&aring; kan anv&auml;ndaren omedelbart f&aring; f&ouml;rs&ouml;ka igen med ett annat svar. Detta inneb&auml;r dock i regel att det blir ett avdrag fr&aring;n det sammanlagda resultatet f&ouml;r varje felaktigt svar (hur stort avdraget blir beror p&aring; faktorn f&ouml;r avdrag, den st&auml;ller Du in med n&auml;sta alternativ).</p>

<p>Det h&auml;r l&auml;get m&ouml;jligg&ouml;r ocks&aring; anpassningsbara fr&aring;gor som kan f&ouml;r&auml;ndra sig sj&auml;lva som reaktion p&aring; en students/elevs/deltagares/l&auml;randes svar.  H&auml;r hittar Du definitionen p&aring; anpassningsbara fr&aring;gor enligt IMS QTI specifikationen (komponenter):</p>

<blockquote>
En anpassningsbar komponent kan f&ouml;r&auml;ndra antingen sitt format, sitt resultat (t.ex. po&auml;ng, sitt s&auml;tt att behandla responser) eller b&aring;da som reaktion p&aring; studentens/elevens/deltagarens/den l&auml;randes f&ouml;rs&ouml;k. 
Som exempel s&aring; kan en anpassningsbar komponent inleda genom att presentera ett f&auml;lt f&ouml;r att mata in text, men om svaret &auml;r otillfredst&auml;llande, s&aring; kan den omvandla det hela till ett enkelt val med f&auml;rdiga alternativ ist&auml;llet. Det kan leda till att svaret (som ju inneh&aring;ller hj&auml;lp) v&auml;rderas l&auml;gre. 
Funktionen att vara anpassningsbar g&ouml;r det m&ouml;jligt f&ouml;r f&ouml;rfattare att skapa komponenter som kan  anv&auml;ndas f&ouml;r formativ utv&auml;rdering som b&aring;de hj&auml;lper till att v&auml;gleda studenten/eleven/deltagaren/den l&auml;rande genom en viss given uppgift och &auml;ven tillhandah&aring;ller ett utfall som tar h&auml;nsyn till dennes v&auml;g genom uppgiften. 
</blockquote>

<p>I l&auml;get anpassning visas f&ouml;r varje fr&aring;ga en kompletterande  <?php print_string('mark', 'quiz') ?> knapp. Om studenten/eleven/deltagaren/den l&auml;rande klickar p&aring; den knappen s&aring; registreras svaret p&aring; just den fr&aring;gan, resultatet ber&auml;knas och det uppn&aring;dda betyget/omd&ouml;met visas. Om det &auml;r en anpassningsbar fr&aring;ga s&aring; kommer den att visas i sin nya form som tar h&auml;nsyn till det tidigare svaret. I m&aring;nga fall kommer studenten/eleven/deltagaren/den l&auml;rande att avkr&auml;vas ett nytt svar. I sin enklaste form kan skillnaden best&aring; av endast &auml;ndringar i texten med &aring;terkoppling och sedan uppmana till ett f&ouml;rnyat f&ouml;rs&ouml;k.  I mer genomarbetade fr&aring;gor kan &auml;ven fr&aring;getexten och t.o.m. de interaktiva komponenterna &auml;ndras.
</p>