<?php
// auth_email.php - created with Totara langimport script version 1.1

$string['auth_emaildescription'] = 'يتم التوثيق عادة عبر البريد الإلكتروني، وهو الوضع الافتراضي لأسلوب التوثيق. فعندما يقوم المستخدم بالتوقيع وباختيار اسم المستخدم وكلمة المرور الخاصة به يتم إرسال رسالة توكيدية إلى عنوانه البريدي. ويحتوي البريد الإلكتروني على رابطة آمنة تؤدي إلى صفحة يستطيع المستخدم من خلالها توكيد اشتراكه. وفي حالة الدخول فيما بعد يتم التحقق من اسم المستخدم وكلمة المرور بمقابلتها بالمخزنة في قاعدة بيانات نظام Moodle..';
$string['auth_emailnoemail'] = 'تمت محاولة إرسال بريد الإكتروني ولكنها فشلت';
$string['auth_emailtitle'] = 'يتم التسجيل الذاتي عن طريق البريد الإلكتروني';

?>
