<?PHP // $Id$ 
      // enrol_database.php - created with Moodle 1.9.13 (Build: 20110801) (2007101591.04)


$string['autocreate'] = 'يمكن إنشاء المقررات آلياً إذا كان هناك تسجيل في مقرر لم يتم إضافته إلى مودل بعد.';
$string['autocreation_settings'] = 'اعدادات الإنشاء الآلي';
$string['category'] = 'التصنيف للمقررات المنشئة آلياً.';
$string['course_fullname'] = 'اسم الحقل الذي تم تخزين اسم المقرر الكامل فيه.';
$string['course_id'] = 'اسم الحقل الذي تم تخزين معرف المقرر فيه. تم استخدام قيم هذا الحقل لمطابقة حقل \"enrol_db_l_coursefield\" في جدول مقرر مودل.';
$string['course_shortname'] = 'اسم الحقل الذي تم تخزين اسم المقرر المختصر فيه.';
$string['course_table'] = 'اسم الجدول الذي نتوقع إيجاد تفاصيل المقرر فيه (الاسم المختصر والمعرف إلخ)';
$string['dbhost'] = 'رقم أو اسم سيرفر الآي بي';
$string['dbname'] = 'اسم قاعدة البيانات';
$string['dbpass'] = 'كلمة مرور السيرفر';
$string['dbtable'] = 'جدول قاعدة البيانات';
$string['dbtype'] = 'نوع قاعدة البيانات';
$string['dbuser'] = 'مستخدم السيرفر';
$string['defaultcourseroleid'] = 'الدور الذي سيتم تعيينه بشكل افتراضي إذا لم يتم تحديد دور آخر.';
$string['description'] = 'تستطيع استخدام قاعدة بيانات خارجية (من أي نوع) للتحكم في التسجيل. يفترض أن قاعدة بياناتك الخارجية تتضمن حقل يحتوي على معرف المقرر وحقل يحتوي على معرف المستخدم. وقد تم مقارنتها مع الحقول التي اخترتها في المقرر المحلي وجداول المستخدم.';
$string['disableunenrol'] = 'If set to yes users previously enrolled by the external database plugin will not be unenrolled by the same plugin regardless of the database contents.';
$string['enrol_database_autocreation_settings'] = 'الإنشاء الآلي للمقررات';
$string['enrolname'] = 'قاعدة بيانات خارجية';
$string['general_options'] = 'خيارات عامة';
$string['host'] = 'اسم مضيف سيرفر قاعدة البيانات.';
$string['ignorehiddencourse'] = 'إذا تم ضبط الخيار نعم فلن يتم تسجيل المستخدمين في مقررات تم ضبطها لتكون غير متوفرة للطلاب.';
$string['local_fields_mapping'] = 'حقول قاعدة بيانات مودل (المحلية)';
$string['localcoursefield'] = 'اسم الحقل في جدول المقرر الذي نستخدمه لمطابقة المدخلات في قاعدة البيانات عن بعد (على سبيل المثال: رقم المعرف).';
$string['localrolefield'] = 'اسم الحقل في جدول الأدوار الذي نستخدمه لمطابقة المدخلات في قاعدة البيانات عن بعد (على سبيل المثال: الاسم المختصر).';
$string['localuserfield'] = 'اسم الحقل في جدول المستخدم الذي نستخدمه لمطابقة المدخلات في قاعدة البيانات عن بعد (على سبيل المثال: رقم المعرف).';
$string['name'] = 'قاعدة بيانات محددة للإستخدام';
$string['pass'] = 'كلمة المرور للوصول للسيرفر';
$string['remote_fields_mapping'] = 'حقول قاعدة بيانات التسجيل(عن بعد).';
$string['remotecoursefield'] = 'اسم الحقل في جدول عن بعد الذي نستخدمه لمطابقة المدخلات في جدول المقرر.';
$string['remoterolefield'] = 'اسم الحقل في جدول عن بعد الذي نستخدمه لمطابقة المدخلات في جدول الأدوار.';
$string['remoteuserfield'] = 'اسم الحقل في جدول عن بعد الذي نستخدمه لمطابقة المدخلات في جدول المستخدم.';
$string['server_settings'] = 'إعدادات سيرفر قاعدة البيانات الخارجية';
$string['student_coursefield'] = 'اسم الحقل في جدول تسجيل الطلاب الذي نتوقع إيجاد معرف المقرر فيه.';
$string['student_l_userfield'] = 'اسم الحقل في جدول المستخدم المحلي الذي نستخدمه لمطابقة المستخدم لتسجيل الطلاب عن بعد(على سبيل المثال: رقم المعرف).';
$string['student_r_userfield'] = 'اسم الحقل في جدول تسجيل الطلاب عن بعد والذي نتوقع إيجاد معرف المستخدم فيه.';
$string['student_table'] = 'اسم الجدول الذي تم تخزين تسجيلات الطلاب فيه.';
$string['teacher_coursefield'] = 'اسم الحقل في جدول تسجيل المعلمين والذي نتوقع إيجاد معرف المقرر فيه.';
$string['teacher_l_userfield'] = 'اسم الحقل في جدول المستخدم المحلي الذي نستخدمه لمطابقة المستخدم لتسجيل المعلمين عن بعد(على سبيل المثال: رقم المعرف).';
$string['teacher_r_userfield'] = 'اسم الحقل في جدول تسجيل المعلمين عن بعد والذي نتوقع إيجاد معرف المستخدم فيه.';
$string['teacher_table'] = 'اسم الجدول الذي تم تخزين تسجيلات المعلمين فيه.';
$string['template'] = 'اختياري: يمكن للمقررات المنشئة آلياً نسخ إعدادتها من مقرر قالب. أدخل هنا الاسم المختصر لمقرر القالب.';
$string['type'] = 'نوع سيرفر قاعدة البيانات';
$string['user'] = 'اسم المستخدم للوصول للسيرفر';

?>
