<?php
// enrol_devplan.php - created with Totara langimport script version 1.1

$string['description'] = 'تقيد وحدة التسجيل DevPlan التسجيل التفاعلي في المقررات. بينما يستخدم المقرر تسجيل DevPlan لإدارة التسجيل التفاعلي، يسمح فقط بالتسجيل الذاتي للمستخدمين الذين تم إدراج المقرر لديهم كعنصر تمت الموافقة عليه كجزء من خطة التطوير الموافق عليها.';
$string['developmentplan'] = 'خطة التطوير';
$string['enrolname'] = 'DevPlan';
$string['guestaccess'] = 'بدون التسجيل، يسمح للزوار <a href=\"$a\"> بوصول محدود لاستعراض المقرر <a href=\"$a\">';
$string['guestnoenrol'] = 'غير قادر على التسجيل في المقرر. أنت بحاجة للإنضمام كمستخدم (وليس زائر) لكي يسمح لك بالتسجيل في هذا المقرر. اضغط \"تسجيل الخروج\" لإيقاف خاصية تصفحك كزائر، وقم بتسجيل الدخول بإستخدام اسم مستخدم فردي وكلمة مرور ومن ثم حاول التسجيل.';
$string['notpermitted'] = 'غير مسموح لك حالياً بالتسجيل في هذا المقرر. <br /> من أجل ان تقوم بالتسجيل يجب أن يتم إدراج هذا المقرر لديك وموافق عليه كلياً في ....';
$string['nowenrolled'] = 'لقد قمت بالتسجيل في هذا المقرر $a.';
$string['redirectedsoon'] = 'انت على وشك إعادة توجيهك.';

?>
