<?PHP // $Id$ 
      // enrol_flatfile.php - created with Moodle 1.9.13 (Build: 20110801) (2007101591.04)


$string['description'] = 'ستقوم هذه الطريقة بالتحقق والمعالجة بشكل متكرر للملف النصي المنسق خصيصاً في الموقع الذي تقوم بتحديده.
يعتبر هذا الملف ملف مفصولاً بفاصلة ويفترض بأن يكون فيه أربع او ست حقول لكل سطر:
<pre>
* العملية، الدور، رقم المعرف (المستخدم)، رقم المعرف (المقرر)، [, وقت البدء, وقت الانتهاء] كالتالي:
* العملية = إضافة | حذف
* الدور = الطالب | المعلم | تحرير المعلم
* رقم المعرف (المستخدم) =  رقم المعرف في طاولة المستخدم NB وليس المعرف 
* رقم المعرف (المقرر) =  رقم المعرف في طاولة المقرر NB وليس المعرف 
* وقت البدء = وقت البدء (في ثوان منذ فترة) - اختياري
* وقت الانتهاء = وقت الانتهاء (في ثوان منذ فترة) - اختياري
</pre>
يمكن ملاحظة شيء كالتالي:
<pre>
إضافة, طالب, 5, CF101
إضافة, معلم, 6, CF101
إضافة, تحرير المعلم, 7, CF101
حذف, طالب, 8, CF101
حذف, طالب, 17, CF101
إضافة, طالب, 21, CF101, 1091115000, 1091215000
</pre>';
$string['filelockedmail'] = 'لا يمكن حذف الملف النصي الذي تستخدمه للإدراج المعتمد على الملف ($a) بواسطة عملية cron. وهذا يعني عادةً بأن التراخيص خائطة في ذلك. يرجى إصلاح التراخيص لكي يتمكن Moodle من حذف الملف وإلا سيتم معالجته بشكل متكرر.';
$string['filelockedmailsubject'] = 'خطأ مهم: ملف الإدراج';
$string['location'] = 'موقع الملف';
$string['mailadmin'] = 'تنبيه المدير بالبريد الإلكتروني';
$string['mailusers'] = 'تنبيه المستخدمين بالبريد الإلكتروني';
$string['enrolname'] = 'ملف مسطح'; // ORPHANED

?>
