<?PHP // $Id$ 
      // enrol_authorize.php - created with Moodle 1.9.13 (Build: 20110801) (2007101591.04)


$string['adminacceptccs'] = 'ما هو نوع بطاقة الأئيمان الذي سيتم مقبول؟';
$string['adminaccepts'] = 'اختر طريق التسديد المسموح بها وأنواعها';
$string['adminauthcode'] = 'إذا لا يمكن القبض على بطاقة الائتمان التابعة للمستخدم عبر شبكة الانترنت مباشرة  سيتم الحصول على رمز الترخيص عبر الهاتف من بنك العميل.';
$string['adminauthorizeccapture'] = 'مراجعة الطلب و إعدادات الاستحواذ الذاتي';
$string['adminauthorizeemail'] = 'إعدادات إرسال البريدالإلكتروني';
$string['adminauthorizesettings'] = 'إعدادات Authorize.net';
$string['adminauthorizewide'] = 'إعدادات الموقع كاملا';
$string['adminavs'] = 'اختر هذا الاختيار إذا قمت بتفعيل نظام التحقق من العنوان (AVS) في حساب authorize.net الخاص بك. هذا النظام يتضمن حقول للعنوان  كالشارع والبلد والدولة والرمز البريدي عندما يقوم المستخدم بتعبئة نموذج الدفع.';
$string['adminconfighttps'] = 'الرجاء التأكد من أن لديك \"<a href=\"$a->url\"> turned loginhttps ON</a>\" حتى تستخدام هذا البرنامج المساعد <br/> في إدارة >> متغيرات >> الأمن >>أمن الHTTP.';
$string['adminconfighttpsgo'] = 'الرجاء الذهاب إلى </ الصفحة الآمنة  a>  <a href=\"$a->url\"> لتكوين هذا البرنامج المساعد.';
$string['admincronsetup'] = 'لم يتم تشغيل مخطوطة صيانة الcron.php في خلال مدة ما لا تقل عن 24 ساعة. <br/> يجب تفعيل كرون إذا كنت تريد استخدام ميزة التقاط المقرر. <br/>فقم <B>بتمكين </ B>  برنامج \'Authorize.net المساعد \'و <b>إعداد كرون </ B> صحيحا؛ أو <b>an_reviewقم بإلغاء </ B> <br/> مرة أخرى. إذا تم تعطيل التقاط المقرر فسيتم إلغاء المعاملات إلا إذا قمت بإعادة النظر فيها في غضون 30 يوما <. br /> <b>تحقق من إختيارك لan_review </ B> وأدخل <B>\'0\'  في حقل an_capture_day </ B> <br/> إذا كنت تريد القيام <B></ B> بقبول / رفض الدفع يدويا في غضون 30 يوما';
$string['adminemailexpired'] = 'هذا مفيد \"لالتقاط اليدوي\" حيث يتم تنبيه المسؤولين قبل أيام ريثما تنتهي الأوامر.        <------->';
$string['adminemailexpiredsort'] = 'حين ترسل الأوامر المنتظر إنتهائها إلى المدرسين بواسطة البريد الإلكتروني أيهم مهم                          <------->';
$string['adminemailexpiredsortcount'] = 'رقم الطلبات';
$string['adminemailexpiredsortsum'] = 'المبلغ الاجمالي';
$string['adminemailexpiredteacher'] = 'إذا كنت قد فعلت الالتقاط اليدوي (انظر إلى الأعلى) و استطاع المدرسون إدارة الدفع فمن الممكن أن ينبهوا هم أيضا ريثما تنتهي الأوامر و ذلك من خلال إرسال رسالة عبر البريد لكل مدرسي المواد عن عدد الأوامر المنتظر إنتهائها';
$string['adminemailexpsetting'] = '(0 = تعطيل إرسال البريد الإلكتروني ، الوضع الإفتراضي = 2 ، الحد الأقصى = 5) <br/>
(إعدادات التقاط اليدوي لإرسال البريد الإلكتروني : كرون = تفعيل ، an_review = فحصت an_capture_day = 0 ، an_emailexpired = 1-5)';
$string['adminhelpcapturetitle'] = 'يوم الاستحواذ الذاتي';
$string['adminhelpreviewtitle'] = 'مراجعة الطلب';
$string['adminneworder'] = 'عزيزي المسؤول،

لقد تلقيت أمرا جديدا في انتظار :

معرف الطلب : $a->orderid 
معرف طلب المعاملة رقم : $a->transid
المستخدم : $a->user
الدورة : $a->course
المبلغ : $a->amount

تفعيل الاستحواذ الذاتي: $a->acstatus

إذا كان التقاط اليدوي نشط فسيتم القبض على بطاقة الائتمان  في $a->captureon ومن ثم سيكون المستخدم مسجل في الدورة، وإلا فإنه سيتم انهاء صلاحية $a->expireon و لن يتم القبض بعد هذا اليوم.

يمكنك أيضا قبول / رفض دفع الطالب للالتحاق مباشرة بعد هذه الوصلة :
$a->url';
$string['adminnewordersubject'] = '$a->course; النظام الجديد المعلق: $a->orderid';
$string['adminpendingorders'] = 'لقد عطلت ميزة الاستحواذ الذاتي. <br/> مجموع $a->count المعاملات  مع الحالة \"المأذون / الالتقاط المعلق\" تلغى إلا إذا قمت بالتحقق منها. <br/> لقبول / رفض الدفع، الرجاء الإنتقال إلىصفحة </a>إدارة الدفع.<a href=\'$a->url\'>';
$string['adminreview'] = 'قم بمراجعة الطلب قبل الإستحواذ على بطاقة الأئتمان';
$string['adminteachermanagepay'] = 'يستطيع المعلمون إدارة الدفعات المالية للمقرر الدارسي';
$string['allpendingorders'] = 'جميع الطلبات الموجودة في قائمة الأنتضار';
$string['amount'] = 'الملبغ';
$string['anlogin'] = 'اسم الدخول  Authorize.net:';
$string['anpassword'] = 'كلمة المرور Authorize.net:';
$string['anreferer'] = '\'لو قمت بإعداد حساب مع authorize.net فقم بتعريف عنوان الرابط المشير إلى ذلك. هذا سيرسل رسالة \"عنوان:المشير\" متضمن الطلب.';
$string['antestmode'] = 'تشغيل المعاملات في وضع الاختبار فقط (لن يتم استخلاص أي أموال)';
$string['antrankey'] = 'Authorize.net: مفتاح المعاملة';
$string['approvedreview'] = 'مراجعة موافقة';
$string['authcaptured'] = 'مرخص / ملتقط';
$string['authcode'] = 'رمز الترخيص';
$string['authorize:managepayments'] = 'إدارة الدفعات المالية';
$string['authorize:uploadcsv'] = 'إيداع ملف CSV';
$string['authorizedpendingcapture'] = 'التقاط مرخص / معلق';
$string['avsa'] = 'العناوون (الشارع) تتطابق و لكن الرمز البريدي لا يتطابق';
$string['avsb'] = 'لم يتم توفير معلومات العنوان';
$string['avse'] = 'خطأ في نظام التحقق من العنوان';
$string['avsg'] = 'بنك يصدر بطاقات غير أمريكية';
$string['avsn'] = 'لا يوخد تطابق في العنوان (الشارع) و لا في الرمز البريدي';
$string['avsp'] = 'نظام التحقق من العنوان لا يطبق هنا';
$string['avsr'] = 'الرجاء المحاولة مرة أخرى - النظام غير موجود أو انتهت المدة الزمنية';
$string['avsresult'] = 'نتيجة AVS:  $a';
$string['avss'] = 'الخدمة غير مدعمة من قبل الموزع';
$string['avsu'] = 'معلومات العنوان غير متوفرة';
$string['avsw'] = 'الرموز البريدية متطابقة و لكن العنوان (الشارع) غير متطابقة
 <----->';
$string['avsx'] = 'العنوان (الشارع) والرموز البريدية التسعة متطابقة';
$string['avsy'] = 'العنوان (الشارع) والرموز البريدية الخمسة متطابقة';
$string['avsz'] = 'الرموز البريدية متطابقة و لكن العنوان (الشارع) ليس مكون من ٥ أحرف     <----->';
$string['canbecredit'] = 'ويمكن ردها إلى $a->upto';
$string['cancelled'] = 'الغي';
$string['capture'] = 'إستحواذ';
$string['capturedpendingsettle'] = 'تسوية مقبوضة / معلقة';
$string['capturedsettled'] = 'مقبوضة / معلقة';
$string['captureyes'] = 'سوف يتم القبض على بطاقة الائتمان، وسوف يكون الطالب مسجلا في الدورة. هل أنت متأكد؟';
$string['ccexpire'] = 'تاريخ نهاية الصلاحية';
$string['ccexpired'] = 'لقد انتهت صلاحية بطاقة االأئتمان';
$string['ccinvalid'] = 'رقم بطاقة الأئتمان غير صحيح';
$string['ccno'] = 'رقم بطاقة الأئتمان';
$string['cctype'] = 'نوع بطاقة الأئتمان';
$string['ccvv'] = 'الرقم التأكيدي لبطاقة الأئتمان';
$string['ccvvhelp'] = 'الرجاء النظر إلى خلف البطاقة (آخر ٣ أرقام)';
$string['choosemethod'] = 'إذا كنت على علم بمفتاح التسجيل في الدورة فالرجاء إدخاله في الأسفل و إلا ستضطر إلا الدفع لهذه الدورة';
$string['chooseone'] = 'الرجاء تعبئة خانة واحدة أو كلا الخانتان. كلمة السر غير مكشوفة.';
$string['costdefaultdesc'] = 'أدخل -١ في إعدادات الدورة حتى تستطيع إستخدام التكلفة الإفتراضية في خانة تكلفة الدورة';
$string['cutofftime'] = 'لقد تم قطع وقت المعاملة. متى سيتم اختيار آخر معاملة للحصول على التسوية؟';
$string['dataentered'] = 'المعلومات المدخلة';
$string['delete'] = 'إعدم';
$string['description'] = 'وحدة Authorize.net تسمح لك بإعداد دورات غير مجانية تدفع لها عن طريق مقدمي خدمات الدفع. إذا كانت التكلفة لأي دورة هو صفر فلا يطلب من الطلاب أن الدفع للدخول. هناك طريقتان لتحديد تكلفة الدورة (1) تحديد التكلفة على مستوى الموقع باعتباره التكلفة الافتراضية للموقع بأكمله أو (2) تحديد إعداد للدورة بحيث يمكنك تعيينه لكل دورة على حدة. تكلفة الدورة تتجاوز تكلفة موقع .<br/> <br/> <b>ملاحظة :</b> إذا قمت بإدخال مفتاح التسجيل في إعدادات الدورات إذن فإن الطلاب سيكون له أيضا الخيار في التسجيل باستخدام مفتاح. فهذا مفيد إذا كان لديك خليط من الطلاب الذين يدفعون و الذين لا يدعفون.';
$string['echeckabacode'] = 'رقم البنك';
$string['echeckaccnum'] = 'رقم الحساب البنكي';
$string['echeckacctype'] = 'نوع الحساب البنكي';
$string['echeckbankname'] = 'اسم البنك';
$string['echeckbusinesschecking'] = 'حساب أعمال بنكي';
$string['echeckchecking'] = 'حساب جاري';
$string['echeckfirslasttname'] = 'صاحب الحساب البنكي';
$string['echecksavings'] = 'حساب توفير';
$string['enrolname'] = 'بوابة الدفع Authorize.net';
$string['expired'] = 'انتهت الصلاحية';
$string['haveauthcode'] = 'لدي مفتاح ترخيص';
$string['howmuch'] = 'كم؟';
$string['httpsrequired'] = 'نحن نأسف لإبلاغكم بأنه لا يمكن معالجة طلبك الآن. لم يمكن تعيين تكوينات هذا الموقع بشكل صحيح. <br/> <br/> يرجى عدم إدخال رقم بطاقة الائتمان الخاصة بك إلا إذا كنت ترى علامة قفل أصفر في الجزء السفلي من المستعرض. فإذا كان الرمز ظاهر فهذا يعني أن الصفحة قد قامت بتشفير جميع البيانات المرسلة بين العميل وخادم الويب بحيث يتم حماية المعلومات خلال المعاملات بين جهازي الكمبيوتر، وبالتالي لا يمكن القبض على رقم بطاقة الائتمان الخاصة بك عبر شبكة الانترنت.';
$string['invalidaba'] = 'رقم البنك غير صحيح';
$string['invalidaccnum'] = 'رقم الحساب البنكي غير صحيح';
$string['invalidacctype'] = 'رقم الحساب البنكي غير صحيح';
$string['logindesc'] = 'يجب أن يكون على هذا الخيار مفعلا. <br> </br/> الرجاء التأكد من أنك قد <a href=\"$a->url\">loginhttps فعلت هذا الخيار</a> و ذلك في الادارية >> متغيرات >> الأمن. <br> </br/> وبنفعيل هذا الخيار سوف يجعل موودل يستخدم الاتصال الآمن HTTPS فقط لتسجيل الدخول وصفحات الدفع.';
$string['logininfo'] = 'لا يتم إظهار كل من اسم الدخول و كلمة السر ومفتاح المعاملة و ذلك بسبب الاحتياطات الأمنية. ليست هناك حاجة إدخالها مرة أخرى إذا كنت قد قمت بتكوين هذه الحقول من قبل حيث إنك ستشاهد نصا باللون الأخضر يسار المربع إذا تم تكوين بعض الخانات. إذا قمت بإدخال معلومات في هذه الحقول لأول مرة فسيتم تعيين إشارة النجمة عند اسم الدخول (*) ويجب أن تدخل على <strong>إما <strong/> مفتاح الصفقة (# 1)  <strong>أو </ قوي> كلمة السر (# 2 ) في الخانة المناسبة و نوصي بإدخال مفتاح المعاملة بسبب الاحتياطات الأمنية. إذا كنت تريد حذف كلمة المرور الحالية فاختر العلامة في خانة الاختيار.';
$string['methodcc'] = 'بطاقة أئتمان';
$string['methodecheck'] = 'شيك إلإلكتروني';
$string['missingaba'] = 'رقم ABA لم يتم توفيره';
$string['missingaddress'] = 'العنوان لم يتم توفيره';
$string['missingbankname'] = 'اسم البنك لم يتم توفيرة';
$string['missingcc'] = 'رقم بطاقة الأئتمان لم يتم توفيره';
$string['missingccauthcode'] = 'رمز الترخيص لم يتم توفيره';
$string['missingccexpire'] = 'تاريخ انتهاء صلاحية بطاقة الأئتمان لم يتم توفيره';
$string['missingcctype'] = 'نوع بطاقة الأئتمان لم يتم توفيره';
$string['missingcvv'] = 'رقم التأكد الخاص ببطاقة الأئتمان لم يتم توفيره';
$string['missingzip'] = 'الرمز البريدي  لم يتم توفيره';
$string['mypaymentsonly'] = 'اعرض دفعاتي المالية فقط';
$string['nameoncard'] = 'الاسم الموجود على رقم بطاقة الأئتمان';
$string['new'] = 'جديد';
$string['noreturns'] = 'لا يوجد عائدات!';
$string['notsettled'] = 'لم تتم التسوية';
$string['orderid'] = 'رقم الطلب';
$string['paymentmanagement'] = 'إدارة الدفعات المالية';
$string['paymentmethod'] = 'نوعية التسديد';
$string['paymentpending'] = 'دفعتك معلقة لهذا طبعا مع هذا العدد لكي $a->orderid. انظر تفاصيل <a href=\'$a->url\'>تفاصيل الطلب<a/>..';
$string['pendingecheckemail'] = 'هناك $a->count من  الechecks المعلقة الآن وعليك إيداع ملف CSV للحصول على المستخدمين المسجلين.

اضغط على الرابط و إقرأ ملف المساعدة على الصفحة المشاهدة 
$a->url';
$string['pendingechecksubject'] = '$a->course: eChecks معلقة ($a->count)';
$string['pendingordersemail'] = 'عزيزي المسؤول،

$a->pending معاملات لدورة \"$a->course\" سوف تنتهي إلا إذا كنت تقبل الدفع في غضون $a->days يوما.

هذه رسالة تحذير لأنك لم تتمكن من التقاط المقرر و هي تعني أن لديك بقبول أو رفض الدفع يدويا.

قبول / رفض الدفعات المعلقة انتقل إلى :
$a->url

وتمكين التقاط المقرر يعني أنك لن تتلقى أي رسائل تحذير بعد الآن فانتقل إلى :

$a->enrolurl';
$string['pendingordersemailteacher'] = 'عزيزي المعلم،

تكلفة $a->pending المعاملات المعلقة  $a->currency $a->sumcost لدورة \"$a->course\" تنتهي إلا إذا قبلت بالدفع في غضون $a->days يوما.

عليك قبول أو رفض الدفع يدويا نظرا لعدم تمكين المسؤول لالتقاط المقرر.

$a->url';
$string['pendingorderssubject'] = 'تحذير : $a->course و $a->pending الأوامر ستنتهي في غضون $a->days أيام.';
$string['reason11'] = 'لقد تم تسليم صفقة مكررة.';
$string['reason13'] = 'معرف تسجيل الدخول التاجر غير صحيح أو حسابه غير نشط.';
$string['reason16'] = 'لم يتم العثور على الصفقة.';
$string['reason17'] = 'لا يقبل التاجر هذا النوع من بطاقات الائتمان';
$string['reason245'] = 'نوع الeCheck هذا غير مسموح به في نموذج الدفع الموجود في بوابة الدفع.';
$string['reason246'] = 'نوع الeCheck هذا غير مسموح به';
$string['reason27'] = 'نتج عن المعاملة عدم تطابق في الAVS. العنوان الموفر لا يطابق عنوان حامل البطاقة الذي ترسل إليه الفواتير.';
$string['reason28'] = 'لا يقبل التاجر هذا النوع من بطاقات الائتمان';
$string['reason30'] = 'التكوينات المصحوبة مع المعالج غير صحيحة. الرجاء الاتصال بموفر خدمات التجار.';
$string['reason39'] = 'رمز العملة المزود بها غير  صحيحة أو غير مدعمة أو غير مسموح بها لهذا التاجر أو ليس لها نسبة تبادل.';
$string['reason43'] = 'تم إنشاء التاجر عند المعالج بشكل غير صحيح. الرجاء الاتصال بموفر خدمات التجار.';
$string['reason44'] = 'لقد تم إلغاء هذه المعاملة. خطأ في فلتر رمز البطاقة';
$string['reason45'] = 'لقد تم إلغاء هذه المعاملة. خطأ في فلتر رمز البطاقة/AVS!';
$string['reason47'] = 'القيمة المطلوبة لهذه التسوية قد لا تكون أكبر من القيمة الأصلية المرخص لها.';
$string['reason5'] = 'مطلوب مبلغ صالح. <------->';
$string['reason50'] = 'هذه المعاملة في انتظار تسوية ولا يمكن ردها.';
$string['reason51'] = 'مجموع كل الائتمانات ضد هذه الصفقة أكبر من مبلغ الصفقة الأصلي.';
$string['reason54'] = 'المعاملة المشار إليها لا تشمل الشروط اللازمة لاصدار الائتمان';
$string['reason55'] = 'مجموع كل الائتمانات ضد هذه الصفقة المشار إليها ستتجاوز قيمة الصفقة الأصلي.';
$string['reason56'] = 'لا يسمح التاجر إلا بمعاملات eCheck (ACH) فقط حيث أنه لا يسمح بأي معاملات بطاقات الائتمان';
$string['refund'] = 'استرجاع';
$string['refunded'] = 'مسترجعة';
$string['returns'] = 'عائدات';
$string['reviewday'] = 'اقبض على بطاقة الائتمان تلقائيا ما لم يقوم معلم أو مسؤول النظام بإعادة النظر في غضون <B>$a </ ب> أيام. يجب تمكين CRON. <br/> (0 اليوم تعني أنه سيتم تعطيل التقاط المقرر وتعني أيضا أن المدرس أو المشرف يقوم بإعادة النظر يدويا. سيتم إلغاء المعاملات إذا تم تعطيل التقاط المقرر أو إعادة النظر فيه إلا إذا كنت ستقوم بذلك في غضون 30 يوما.)';
$string['reviewfailed'] = 'فشل إعادة النظر';
$string['reviewnotify'] = 'سيتم مراجعة دفعتك المالية. توقع بريد الإلكتروني خلال أيام مرسل من معلمك.';
$string['sendpaymentbutton'] = 'أرسل دفعة المالية';
$string['settled'] = 'تم التسديد';
$string['settlementdate'] = 'تاريخ التسديد';
$string['subvoidyes'] = 'المعاملة المسترجعة ($a->transid) ستلغى و سيحدث ذلك ائتمان  $a->amount  في حسابك. هل أنت متأكد؟';
$string['tested'] = 'تم اختباره';
$string['testmode'] = '(وضع أختباري)';
$string['testwarning'] = 'القبض على / الإلغاء / الإسترجاع يبدو أنها تعمل في وضع الاختبار ولكن لم تم تحديث أي سجل أو إدراجها في قاعدة بيانات .';
$string['transid'] = 'الرقم التعريفي للصفقة';
$string['underreview'] = 'تحت إعادة النظر';
$string['unenrolstudent'] = 'هل سيتم إلغاء تسجيل الطالب؟';
$string['uploadcsv'] = 'إيداع ملف CSV';
$string['usingccmethod'] = 'التسجيل بواسطة <a href=\"$a->url\"><strong>البطاقة الائتمانية</strong></a>';
$string['usingecheckmethod'] = 'التسجيل بواسطة <a href=\"$a->url\"><strong>eCheck</strong></a>';
$string['void'] = 'ملغي';
$string['voidyes'] = 'سيتم إلغاء الصفقة. هل أنت متأكد؟';
$string['welcometocoursesemail'] = 'عزيزي الطالب،

شكرا على المدفوعات الخاصة بك. وقد التحق لكم هذه المقررات :

$a->courses

يمكنك تحرير ملف التعريف الخاص بك :
$a->profileurl

يمكنك عرض تفاصيل الدفع الخاصة بك :
$a->paymenturl';
$string['youcantdo'] = 'لا تستطيع القيام بهذا الأجراء: $a->action';
$string['zipcode'] = 'الرمز البريدي';

?>
