<?php
// enrol_manual.php - created with Totara langimport script version 1.0

$string['description'] = 'هذه هي الطريقة الافتراضية للتسجيل. هناك طريقتين لتسجيل الطلاب أو المتدربين في مقرر محدد.
<ul>

<li>المدرب أو مدير النظام يمكنه تسجيلهم يدوياً من خلال قائمة ادارة المقرر من داخل المقرر</li>
<li>المقرر يحتوي على كلمة مرور معرفة مسبقاً تسمى بـ \"مفتاح التسجيل\". أي شخص يعرف هذا المفتاح يمكنه تسجيل نفسه في المقرر</li>
</ul>';
$string['enrol_manual_requirekey'] = 'مطلوب مفتح تسجيل للمقررات الجديدة ومنع إزالة المفاتيح الموجودة';
$string['enrol_manual_showhint'] = 'تمكين هذا الإعداد للكشف عن الحرف الأول من مفتاح التسجيل كتلميح في حالة ادخال مفتاح غير صحيح';
$string['enrol_manual_usepasswordpolicy'] = 'استخدم سياسة كلمة المرور الحالية لمفتاح تسجيل المقررات';
$string['enrolmentkeyerror'] = 'مفتاح المقرر غير صحيح، الرجاء المحاولة مرة أخرى';
$string['enrolname'] = 'تسجيل داخلي';
$string['keyholderrole'] = 'صلاحيات المستخدم الذي يمتلك مفتاح التسجيل في المقرر. معروض للطلاب الذين يحاولون التسجيل في المقرر.';

?>
