<?PHP // $Id$ 
      // enrol_dbpositions.php - created with Moodle 1.9.13 (Build: 20110801) (2007101591.04)


$string['dbhost'] = 'اسم السيرفر أو رقم IP';
$string['dbname'] = 'اسم قاعدة البيانات';
$string['dbpass'] = 'كلمة مرور السيرفر';
$string['dbtable'] = 'جدول قاعدة البيانات';
$string['dbtype'] = 'نوع قاعدة البيانات';
$string['dbuser'] = 'مستخدم السيرفر';
$string['description'] = 'يمكنك استخدام قاعدة بيانات خارجية (من أي نوع تقريباً) للتحكم بعلاقاتك بين المستخدمين. من المفترض أن قاعدة بياناتك الخارجية تحتوي على حقل يحتوي على معرف مستخدمين اثنين، ومعرف الدور. تتم مقارنة هذه مع الحقول التي قمت باختيارها في المستخدم المحلي وجداول الدور';
$string['enrolname'] = 'قاعدة بيانات خارجية (تعيينات الموقع)';
$string['fullnamefield'] = 'سيتم استخدام اسم الحقل في قاعدة البيانات الخارجية كاسم كامل لتعيين الموقع';
$string['localobjectuserfield'] = 'اسم الحقل في جدول المستخدم الذي نستخدمه لمطابقة المدخلات في قاعدة البيانات عن بعد (على سبيل المثال: رقم المعرف). for the <i>staff member</i> role assignment';
$string['localorgfield'] = 'اسم الحقل في جدول الجهات الذي نسخدمه لمطابقة المدخلات في قاعدة البيانات عن بعد (على سبيل المثال: رقم المعرف).';
$string['localposfield'] = 'اسم الحقل في جدول المواقع الذي نستخدمه لمطابقة المدخلات في قاعدة البيانات عن بعد (على سبيل المثال: رقم المعرف).';
$string['localsubjectuserfield'] = 'اسم الحقل في جدول المستخدم الذي نستخدمه لمطابقة المدخلات في قاعدة البيانات عن بعد (على سبيل المثال: رقم المعرف). for the <i>manager</i> role assignment';
$string['postypefield'] = 'حقل نوع الموقع - اسم الحقل في جدول خارجي والذي يصف في أي نوع من الموقع الذي سيتم إنشائه - الرئيسي / الثانوي / الطموح. إذا لم يتم تحديد ذلك فإنه يفترض أن تكون جميع الصفوف تابعة لتعيينات الموقع الرئيسي.';
$string['remote_fields_mapping'] = 'ربط حقل قاعدة البيانات';
$string['remoteobjectuserfield'] = 'اسم الحقل في الجدول عن بعد الذي نستخدمه لمطابقة المدخلات في جدول المستخدم لـ<i>staff member</i> role assignment';
$string['remoteorgfield'] = 'اسم الحقل في الجدول عن بعد الذي نستخدمه لمطابقة المدخلات في قاعدة بيانات الجهات (على سبيل المثال: الفريق).';
$string['remoteposfield'] = 'اسم الحقل في الجدول عن بعد الذي نستخدمه لمطابقة المدخلات في جدول المواقع (على سبيل المثال: الموقع).';
$string['remotesubjectuserfield'] = 'اسم الحقل في الجدول عن بعد الذي نستخدمه لمطابقة المدخلات في جدول المستخدم لـthe <i>manager</i> role assignment';
$string['roleshortname'] = 'The shortname of the role that should be assigned to the manager in the context of the staff member.';
$string['server_settings'] = 'إعدادت سيرفر قاعدة البيانات الخارجية';
$string['shortnamefield'] = 'سيتم استخدام اسم الجدول عن بعد كاسم مختصر لتعيين الموقع';
$string['useauthdb'] = 'استخدام نفس الإعدادات لاتصال قاعدة البيانات كما يستخدم plugin مصادقة قاعدة البيانات (لا تزال بحاجة الى تحديد اسم الجدول)';
$string['useenroldatabase'] = 'استخدام نفس الإعدادات لاتصال قاعدة البيانات كما يستخدم plugin التسجيل بقاعدة البيانات (لا تزال بحاجة الى تحديد اسم الجدول)';
$string['localrolefield'] = 'اسم الحقل في جدول الأدوار الذي نقوم به لتطابق الإدخالات في قاعدة البيانات عن بعد (على سبيل المثال shortname).'; // ORPHANED
$string['remoterolefield'] = 'اسم الحقل في الجدول البعيد الذي نحن به لمطابقة الإدخالات في الجدول الأدوار.'; // ORPHANED

?>
