<?PHP // $Id$ 

$string['accept'] = 'ยอมรับ';
$string['alert_description'] = 'ด้านล่างมีการแจ้งเตือนทั้งหมดที่คุณได้รับ คุณสามารถคลิกที่ลิงก์ในชื่อเรื่องการแจ้งเตือนเพื่อดูรายละเอียดเพิ่มเติมหรือยกเลิกการแจ้งเตือนโดยคลิกที่ไอคอนยกเลิกไปทางขวาของรายการ นอกจากนี้คุณยังสามารถเลือกที่จะกรองการแจ้งเตือนที่แสดงในรายการโดยการใช้ "ค้นหาโดย" การทำงาน';
$string['alertfooter'] = 'เมื่อต้องการเปลี่ยนการตั้งค่าของของคุณสำหรับการที่ได้รับอีเมลเหล่านี้แล้วให้ไปที่ดูข้อมูลส่วนตัวของ href="{$a}"> ของคุณ <a -> Messages </a แท็บ>';
$string['alerts'] = 'การแจ้งเตือน';
$string['blended'] = 'ปั่น';
$string['cannotsavemessage'] = 'ไม่สามารถบันทึกข้อความ';
$string['competency'] = 'ขีดความสามารถ';
$string['course'] = 'หลักสูตร';
$string['dismiss'] = 'ยกเลิก';
$string['elearning'] = 'อีเลิร์นนิ่ง';
$string['emailnotifications'] = 'แจ้งทางอีเมล';
$string['error:redirecttoexternal'] = 'ข้อผิดพลาด: พยายามที่จะเปลี่ยนเส้นทางไปยังโดเมนภายนอก';
$string['evidence'] = 'หลักฐาน';
$string['facetoface'] = 'ตัวต่อตัว';
$string['learningplan'] = 'แผนการเรียนรู้';
$string['messages'] = 'ข้อความ';
$string['messagesettings'] = 'การตั้งค่าข้อความ';
$string['nextaction'] = 'การดำเนินการต่อไป';
$string['noscript'] = 'กรุณาเปิดใช้งาน JavaScript ในเบราว์เซอร์ของคุณ';
$string['notyours'] = 'นี่ไม่ใช่ข้อความของคุณ: {$a}';
$string['objective'] = 'วัตถุประสงค์';
$string['reject'] = 'ปฏิเสธ';
$string['resource'] = 'ทรัพยากร';
$string['sendalertemails'] = 'ส่งให้ฉันเกี่ยวกับการแจ้งเตือน';
$string['sendtaskemails'] = 'ส่งอีเมลแจ้งเกี่ยวกับงาน';
$string['settingssaved'] = 'การตั้งค่าที่บันทึกไว้';
$string['task_description'] = 'ข้างล่างนี้ทุกงานที่คุณได้รับ คุณสามารถคลิกที่ลิงก์ในชื่องานเพื่อดูรายละเอียดเพิ่มเติมหรือยกเลิกงานโดยคลิกที่ไอคอนยกเลิกไปทางขวาของรายการ นอกจากนี้คุณยังสามารถเลือกที่จะกรองซึ่งงานแสดงในรายการโดยการใช้ "ค้นหาโดย" การทำงาน';
$string['tasks'] = 'งาน';
$string['unknown'] = 'ไม่ทราบ';
$string['viewdetailshere'] = 'อ่านรายละเอียดเพิ่มเติมสามารถพบได้ที่: <br /> <br /> <a href="{$a}"> {$a} </a>';
$string['withselected'] = 'ด้วยที่เลือก:';

?>
