<h1>Rapport &ouml;ver deltagande</h1>

<p><strong>Aktivitetsmodul</strong> - V&auml;lj den typ av aktivitet som Du vill rapportera (t.ex.  Chat, Forum, Test etc). L&auml;gg m&auml;rke till att endast de moduler som Du anv&auml;nder i kursen kommer att listas i nedrullningsmenyn.</p>

<p><strong>Tillbakablick</strong> - V&auml;lj den period som Du vill rapportera om.</p>

<p><strong>Visa bara </strong>- V&auml;lj om Du vill k&ouml;ra rapporten p&aring; aktivitet f&ouml;r student/elev/deltagare/l&auml;rande  eller p&aring; aktivitet f&ouml;r (distans)l&auml;rare.</p>

<p><strong>Visa handlingar</strong> - V&auml;lj om Du vill ha en rapport som visar antingen aktiviteter eller inl&auml;gg eller b&aring;da (alla handlingar).</p>

<p>N&auml;r Du v&auml;l har matat in v&auml;rden f&ouml;r de ovanst&aring;ende parametrarna (dvs gjort Dina val) s&aring; ska Du v&auml;lja <strong>G&aring; </strong>.</p>

<p>En lista &ouml;ver alla f&ouml;rekomster av den valda aktivitetsmodulen i den h&auml;r kursen kommer att skapas.

V&auml;lj den komponent som Du ha en rapport om och v&auml;lj <strong>G&aring; </strong>.</p>

<p>Definitionen av vy och inl&auml;gg f&ouml;r den valda typen av aktivitet kommer att ges p&aring; sk&auml;rmen.
<br />

  Till exempel:<br />

  <strong><em>Vy f&ouml;r forum: </em></strong>Visa diskussions&auml;mnen, s&ouml;k, forum, prenumeranter.
<br />

  <em><strong>Inl&auml;gg i forum</strong></em>: L&auml;gg till diskussions&auml;mne, L&auml;gg till inl&auml;gg, Ta bort diskussions&auml;mne, 

 Ta bort inl&auml;gg, Flytta diskussions&auml;mne, Rensa inl&auml;gg, Uppdatera inl&auml;gg.</p>

<p>Anv&auml;ndare som matchar  <strong>Visa </strong> kriterierna (f&ouml;r student/elev/deltagare/l&auml;rande eller (distans)l&auml;rare)kommer att listas i tabellformat efter  
namn/ID-nummer och huruvida och hur m&aring;nga g&aring;nger de har genomf&ouml;rt den handling som Du har s&ouml;kt p&aring; t.ex. (Ja (n) eller Nej) . Du kan &auml;ven anv&auml;nda rapporten &ouml;ver deltagande f&ouml;r att skicka e-post enligt en lista med de aktuella anv&auml;ndarna och v&auml;lja <strong>L&auml;gg till markerade anv&auml;ndare till listan &ouml;ver mottagare eller formulera ett e-postmeddelande.</strong>.</p>