<h1>Anv&auml;ndning av Wiki </h1>
<p>
<br />
Wiki &auml;r en plattform f&ouml;r att samarbeta om utformning av och inneh&aring;ll i webbsidor. Principerna &auml;r enkla.
<br />

<ul>
<li>Man skriver och sparar en text.</li>
<li>Senare kan en annan person l&auml;sa denna text och tycka att det beh&ouml;vs en del &auml;ndringar och r&auml;ttelser. Denne v&auml;ljer 'Redigera' och genomf&ouml;r sina &auml;ndringar av sidan. </li>
<li>Efter det att den nya versionen har sparats s&aring; &auml;r den tillg&auml;nglig f&ouml;r alla.</li>
</ul>

Med en wiki, &auml;r det likaledes m&ouml;jligt att enkelt l&auml;gga till en sida eller l&auml;nka till existerande sidor. 

<ul>
<li>En l&auml;nk skapas med hj&auml;lp av ett WikiOrd. Detta &auml;r ett ord som inneh&aring;ller &aring;tminstone tv&aring; stora bokst&auml;ver. Om det redan finns en sida med detta namn s&aring; kommer den att l&auml;nkas automatiskt, om inte, s&aring; kommer namnet att visas f&ouml;ljt av ett fr&aring;getecken.</li>
<li>Om Du klickar p&aring; fr&aring;getecknet s&aring; kommer det att &ouml;ppnas en ny sida med detta namn och det &auml;r bara att s&auml;tta ig&aring;ng och redigera denna sida. </li>
</ul>

<h3>Formateringsregler f&ouml;r Wiki</h3>

<h4> Stycken</h4>
  <ul>
  <li> separera stycken inne i texten med hj&auml;lp av tomma rader. </li>
  <li> anv&auml;nd tre procenttecken %%% f&ouml;r att &aring;stadkomma en radbrytning. </li>
  <li> om Du inleder en textrad med mellanslag eller tabbmatningar s&aring; kommer raden att bli indragen. </li>
  </ul>

<h4> !! Rubriker</h4>

  <ul type="circle">
  <li> anv&auml;nd ett utropstecken ! i b&ouml;rjan av en rad f&ouml;r att skapa en liten rubrik. </li>

  <li> !! medelstora rubriker</li>
  <li> !!! stora rubriker</li>
  </ul>

<h4>Text - stil</h4>

  <ul>

  <li> Om Du vill <em>ge eftertryck &aring;t text</em> d&aring; ska Du inrama den med tv&aring; enkla apostrofer '' (resultatet blir oftast kursiv stil).</li>
  <li> <strong>text blir fet</strong> med tv&aring; streck f&ouml;r understrykning __ (eller om den &auml;r inramad med tv&aring; asterisker **)</li>
  <li> f&ouml;r att &aring;stadkomma <big>stor text</big> ska Du inrama den med grindtecken ##</li>

  <li> Du kan f&aring;  <small> mindre text </small> genom att anv&auml;nda "µµ" p&aring; samma s&auml;tt</li>
  <li> ett <tt>typsnitt av skrivmaskinstyp</tt> f&aring;r Du om Du inramar texten med tv&aring; likhetstecken ==  . </li>
  </ul>

<h4>Listor</h4>

  <ul>
  <li> inled en rad med en asterisk * f&ouml;r att p&aring;b&ouml;rja en lista</li>
  <li> anv&auml;nd # f&ouml;r numrerade listor
    <ol>
    <li> Du kan skapa underlistor</li>

    <li> &aring;tf&ouml;ljande listpunkter b&ouml;r inledas med samma blandning av   * och #    </li>
    </ol>
  </li>
  </ul>

<h4> HyperL&auml;nkar</h4>

  <ul>

  <li> skriv bara in ett WikiOrd inne i Din text f&ouml;r att skapa en ny hyperl&auml;nk</li>
  <li> inrama n&aring;gra ord i [hakparenteser] f&ouml;r att skapa en ny hyperl&auml;nk inne i WikiWikiWeb som inte &auml;r uppbyggd av ett giltigt WikiOrd</li>

  <li> vilken giltig internetadress (som inleds med http:/) som http://www.exempel.com/ inne i texten kommer att bli klickbar automatiskt</li>
  <li> inrama en www-adress eller en WikiL&auml;nk inne i hakparenteser och tilldela den en l&auml;mplig titel genom att anv&auml;nda citattecken eller ett | tecken. 
    <ul>
    <li> [title | http://exempel.com]</li>

    <li> [WikiOrd "titel"] eller ["titel f&ouml;r" WikiL&auml;nk]    </li>
    </ul>
  </li>
  <li> om Du inte vill anv&auml;nda ett WikiOrd eller en http://www-adress (eller [n&aring;gonting] inne i hakparenteser) f&ouml;r att den ska bli en HyperL&auml;nk s&aring; beh&ouml;ver Du bara l&aring;ta den f&ouml;reg&aring;s av ett utropstecken eller ett tildetecken ~
    <ul>
    <li> !IngenHyperL&auml;nk, ~IngenHyperL&auml;nk</li>
    <li> ![ingen hyperl&auml;nk], !http://ingenl&auml;nk.org/    </li>

    </ul>
  </li>
  </ul>

<h4> Tabeller med |</h4>
| inrama bara | saker med 'dash' | tecknet | <br />
| f&ouml;r att bygga en  | tabellstruktur  | <br />
| webbl&auml;sare utel&auml;mnar vanligtvis | de saknade | cellerna | <br />

<p>
Var sn&auml;ll och l&auml;gg alltid in en tom rad f&ouml;re och efter en tabell s&aring; att den skiljer sig markant fr&aring;n annan text i sitt eget stycke.
</p>

<h4> Bilder</h4>

  <ul>

  <li> f&ouml;r att ta med en bild p&aring; en sida s&aring; ska Du inrama den med dess absoluta www-adress i hakparenteser som t.ex. [http://www.exempel.com/pics/bild.png] </li>
  <li> alternativt skulle Du kunna anv&auml;nda funktionen att ladda upp bilder.</li>
  </ul>

<h4>Att l&auml;sa mera</h4>
Det finns fler m&ouml;jligheter att m&auml;rka upp Wiki. Konsultera g&auml;rna <a href="http://erfurtwiki.sourceforge.net" target="_new">Erfurt Wiki Homepage</a> f&ouml;r mer information.