<?PHP // $Id$
      // block_glossary_random.php - created with Moodle 1.9.8+ (Build: 20100407) (2007101580)


$string['addentry'] = 'הוסף מונח חדש';
$string['askaddentry'] = 'כאשר משתמשים יכולים להוסיף מונחים לאגרון המונחים, הצג את הקישור עם טקסט זה';
$string['askinvisible'] = 'כאשר משתמשים לא יכולים לערוך או לצפות באגרון המונחים, הצג טקסט זה (ללא קישור)';
$string['askviewglossary'] = 'כאשר משתמשים יכולים לצפות באגרון המונחים, אך לא לערוך את המונחים, הצג קישור עם טקסט זה';
$string['blockname'] = 'מונח אקראי מאגרון המונחים';
$string['intro'] = 'תוכל לשנות את ההגדרות שלהלן רק לאחר שהוגדר לפחות אגרון מונחים אחד עם מונח אחד לכל הפחות';
$string['invisible'] = '(המשך יבוא)';
$string['lastmodified'] = 'המונח האחרון שעודכן';
$string['nextone'] = 'המונח הבא';
$string['noentriesyet'] = 'עדיין אין מונחים באגרון המונחים הנבחר.';
$string['notyetconfigured'] = 'אנא הגדר משבצת זו בעזרת סמל העריכה.';
$string['notyetglossary'] = 'חובה שיהיה לך לפחות אגרון מונחים אחד לבחור בו.';
$string['random'] = 'מונח אקראי';
$string['refresh'] = 'מספר הימים לפני בחירת מונח חדש';
$string['select_glossary'] = 'הצג מונחים מאגרון מונחים זה';
$string['showconcept'] = 'הצג כותרת עבור כל מונח';
$string['title'] = 'כותרת';
$string['type'] = 'האופן בו נבחר מונח חדש';
$string['viewglossary'] = 'מונחים נוספים....';
$string['whichfooter'] = 'באפשרותך להציג קישורים לפעולות של אגרון המונחים שמשבצת זו מקושרת אליו. המשבצת תציג רק קישורים לפעולות שמאופשרות במאגרון המונחים.';
$string['typehelp'] = '<b>המונח האחרון ששונה</b> יציג תמיד את המונח האחרון ששונה, ו<b>מונח אקראי</b> יציג מונח אקראי מאגרון המונחים שייבחר בכל פעם. האפשרות <b>המונח הבא</b> תאפשר צפייה בכל המונחים לפי הסדר. אפשרות זו שימושית במיוחד כאשר נקבע מספר ימים, מאחר וזה מאפשר ליישם <i>מונח השבוע</i> או <i>מונח היום</i> שכל אחד יכול לראות.'; // ORPHANED

?>
<?PHP // $Id$
      // block_glossary_random.php - created with Moodle 1.9.5+ (Build: 20090624) (2007101550)



$string['askaddentry'] = 'כאשר משתמשים יכולים להוסיף מונחים למילון המונחים, הצג קישור עם טקסט זה';
$string['askinvisible'] = 'כאשר משתמשים לא יכולים לערוך או לצפות במילון המונחים, הצג טקסט זה (ללא קישור)';
$string['askviewglossary'] = 'כאשר משתמשים יכולים לצפות במילון המונחים, אבל לא לערוך את המונחים, הצג קישור עם טקסט זה';
$string['blockname'] = 'מונח אקראי';
$string['intro'] = 'עליך לוודא שהוגדר לפחות מילון מונחים אחד עם מונח אחד לפחות עבור קורס זה. לאחר מכן, תוכל לשנות את ההגדרות שלהלן';
$string['noentriesyet'] = 'עדיין אין מונחים במילון המונחים הנבחר.';
$string['notyetglossary'] = 'חובה שיהיה לך לפחות מילון מונחים אחד לבחור בו.';
$string['select_glossary'] = 'הצג מונחים ממילון מונחים זה';
$string['whichfooter'] = 'יש באפשרותך להציג קישורים לפעולות של מילון המונחים שבלוק זה מקושר אליו. הבלוק יציג רק קישורים לפעולות שמאופשרות במילון המונחים.';

?>
