<?PHP // $Id: enrol_database.php,v 1.5 2008/12/23 11:54:38 emanuel1 Exp $
      // enrol_database.php - created with Moodle 1.9.3+ (Build: 20081126) (2007101532)


$string['autocreate'] = 'ניתן ליצור קורסים באופן אוטומטי במידה ויש הרשמות לקורס שעדיין לא קיים במוודל.';
$string['autocreation_settings'] = '(Autocreation) הגדרות יצירה-אוטומטית';
$string['category'] = 'הקטגוריה שמיועדת עבור קורסים שנוצרו באופן אוטומטי.';
$string['course_fullname'] = 'שם השדה בו מאוכסן השם המלא של הקורס.';
$string['course_id'] = 'שם השדה בו מאוחסן מספר הזיהוי של הקורס. הערכים בשדה הזה משמשים על מנת להתאים את הערכים שנמצאים בשדה \"enrol_db_l_coursefield\" בטבלת הקורס של מוודל.';
$string['course_shortname'] = 'שם השדה בו מאוחסן השם הקצר של הקורס.';
$string['course_table'] = 'שם הטבלה בה אנו מצפים למצוא את פרטי הקורס (שם קצר, שם מלא, מספר זיהוי וכו\'.)';
$string['dbhost'] = 'מספר או שם ה-IP של השרת';
$string['dbname'] = 'שם בסיס הנתונים';
$string['dbpass'] = 'הסיסמא של השרת';
$string['dbtable'] = 'טבלת בסיס הנתונים';
$string['dbtype'] = 'סוג בסיס הנתונים';
$string['dbuser'] = 'משתמש השרת';
$string['defaultcourseroleid'] = 'התפקיד שיינתן כברירת מחדל במידה ולא צויין אף תפקיד אחר';
$string['description'] = 'אתה יכול להשתמש בבסיס נתונים חיצוני (כמעט מכל סוג שהוא) כדי לשלוט בהרשמות שלך. אנו יוצאים מנקודת הנחה שבבסיס הנתונים החיצוני שלך ישנו שדה שמכיל מספר זיהוי של קורס, ושדה שמכיל מספר זיהוי של משתמש. שדות אלה מושווים אל מול שדות שאתה בוחר בקורס המקומי ובטבלאות המשתמשים.';
$string['disableunenrol'] = 'אם מאופשר, משתמשים שנרשמו קודם לכן ע\"י מסנן מסד נתונים חיצוני ירשמו ע\"י אותו מסנן בלי להתחשב בתוכן מסד הנתונים.';
$string['enrol_database_autocreation_settings'] = 'יצירה אוטומטית של קורסים חדשים';
$string['enrolname'] = 'בסיס נתונים חיצוני';
$string['general_options'] = 'אפשרויות כלליות';
$string['host'] = 'שם המחשב המארח את שרת בסיס הנתונים';
$string['ignorehiddencourse'] = 'כאשר מאפשרים זאת, משתמשים לא הירשמו לקורסים אשר מוגדרים להיות לא זמינים לסטודנטים.';
$string['local_fields_mapping'] = 'שדות בסיס הנתונים (המקומי) של מוודל';
$string['localcoursefield'] = 'שם השדה בטבלת הקורס בו אנו משתמשים כדי להתאים רשומות בבסיס הנתונים החיצוני (כלומר מספר זיהוי).';
$string['localrolefield'] = 'שם השדה בטבלת התפקידים בו אנו משתמשים כדי להתאים רשומות בבסיס הנתונים החיצוני (כלומר שם קצר).';
$string['localuserfield'] = 'שם השדה בטבלת המשתמשים בו אנו משתמשים כדי להתאים רשומות בבסיס הנתונים החיצוני (כלומר מספר זיהוי).';
$string['name'] = 'בסיס הנתונים המסויים בו יש להשתמש';
$string['pass'] = 'סיסמה המשמשת כדי לקבל גישה לשרת';
$string['remote_fields_mapping'] = 'שדות הרשמה בבסיס הנתונים (החיצוני)';
$string['remotecoursefield'] = 'שם השדה בטבלה החיצונית בו אנו משתמשים כדי להתאים רשומות בטבלת הקורס';
$string['remoterolefield'] = 'שם השדה בטבלה החיצונית בו אנו משתמשים כדי להתאים רשומות בטבלת התפקידים';
$string['remoteuserfield'] = 'שם השדה בטבלה החיצונית בו אנו משתמשים כדי להתאים רשומות בטבלת המשתמשים';
$string['server_settings'] = 'הגדרות השרת של בסיס הנתונים החיצוני';
$string['student_coursefield'] = 'שם השדה בטבלת הרשמות הסטודנטים בו אנו מצפים למצוא את מספר הזיהוי של הקורס.';
$string['student_l_userfield'] = 'שם השדה בטבלת המשתמשים המקומיים בו אנו משתמשים כדי להתאים את המשתמש לרשומה החיצונית לסטודנטים (כלומר, מספר זהוי).';
$string['student_r_userfield'] = 'שם השדה בטבלת הרשמת הסטודנטים החיצונית בו אנו מצפים למצוא את מספר זיהוי המשתמש.';
$string['student_table'] = 'שם הטבלה בה מאוחסנות הרשמות הסטודנטים.';
$string['teacher_coursefield'] = 'שם השדה בטבלת ההרשמה של המורה בו אנו מצפים למצוא את מספר הזיהוי של הקורס.';
$string['teacher_l_userfield'] = 'שם השדה בטבלת המשתמשים המקומיים בו אנו משתמשים כדי להתאים את המשתמש לרשומה החיצונית למורים (כלומר, מספר זיהוי).';
$string['teacher_r_userfield'] = 'שם השדה, בטבלת ההרשמה החיצונית של המורה, בו אנו מצפים למצוא את מספר זיהוי המשתמש.';
$string['teacher_table'] = 'שם הטבלה בה נשמרות הרשמות המורה.';
$string['template'] = 'לבחירתכם: קורסים שנוצרו באופן אוטומטי יכולים להעתיק את ההגדרות שלהם מתוך קורס תבנית. הקלד כאן את השם הקצר של קורס התבנית.';
$string['type'] = 'סוג השרת של בסיס הנתונים.';
$string['user'] = 'שם משתמש על מנת לקבל גישה לשרת.';
$string['local_coursefield'] = 'שם השדה בטבלת הקורס בו אנו משתמשים על מנת להתאים את הרשומות בבסיס הנתונים החיצוני (כלומר, מספר זיהוי).'; // ORPHANED

?>
