<?PHP // $Id$
      // enrol_devplan.php - created with Moodle 1.9.11 (Build: 20110221) (2007101591.02)
      // local modifications from http://www.kineoisrael.com/totara


$string['description'] = 'רכיב ההרשמה באמצעות תכניות התפתחות מגביל את ההרשמה האינטראקטיבית לקורסים. כשקורס משתמש בתוסף הרשמה זה, רק משתמשים שהקורס מופיע להם כמרכיב מאושר בתכנית ההתפתחות שלהם מורשים להירשם לקורס בעצמם.';
$string['developmentplan'] = 'תכנית התפתחות';
$string['enrolname'] = 'הרשמת תכנית התפתחות';
$string['guestaccess'] = 'ללא הרשמה, לאורחים יש <a href=\"$a\">גישה מוגבלת לצפייה בקורס</a>.<br />';
$string['guestnoenrol'] = 'לא ניתן היה להירשם לקורס. עליך להיות משתמש רשום (לא אורח) על מנת להירשם לקורס זה. לחץ על \'התנתק\' כדי להפסיק לנווט כאורח, והתחבר בעזרת שם משתמש וסיסמא, ואז נסה להירשם שוב.';
$string['notpermitted'] = 'בשלב זה אינך רשאי להירשם לקורס זה.<br />על מנת להירשם, הקורס חייב להיות רשום ומאושר ב';
$string['nowenrolled'] = 'נרשמת לקורס $a.';
$string['redirectedsoon'] = 'מיד תועבר לדף חדש.';

?>
