<?PHP // $Id$ 
      // enrol_dbpositions.php - created with Moodle 1.9.13 (Build: 20110801) (2007101591.04)


$string['dbhost'] = 'מספר או שם IP שרת';
$string['dbname'] = 'שם בסיס הנתונים';
$string['dbpass'] = 'סיסמת שרת';
$string['dbtable'] = 'טבלת בסיס נתונים';
$string['dbtype'] = 'סוג בסיס נתונים';
$string['dbuser'] = 'שם משתמש בשרת';
$string['description'] = 'באפשרותך להשתמש בבסיס נתונים חיצוני (מכמעט כל סוג שהוא) על מנת לנהל את היחסים בין משתמשים. ההנחה היא שבסיס הנתונים החיצוני מכיל שדות עם שני קודי זיהוי של משתמשים, וקוד זיהוי תפקיד. אלו ייבדקו מול שדות שתבחר בטבלאות משתמשים ותפקידים במערכת.';
$string['enrolname'] = 'בסיס נתונים חיצוני (יחסים בין משתמשים)';
$string['fullnamefield'] = 'שם השדה בבסיס הנתונים החיצוני שישמש כשם המלא להקצאת תפקידים.';
$string['localobjectuserfield'] = 'שם השדה בטבלת המשתמשים בו נשתמש כדי להשוות רשומות בבסיס הנתונים המרוחק (כלומר קוד הזיהוי) עבור הקצאת תפקיד ה-<i>object</i>.';
$string['localorgfield'] = 'שם השדה בטבלת הארגונים בו אנו משתמשים להתאמת רשומות בבסיס הנתונים המרוחק (למשל שדה תעודת זהות - idnumber)';
$string['localposfield'] = 'שם השדה בטבלת התפקידים בו אנו משתמשים להתאמת רשומות בבסיס הנתונים המרוחק (למשל שדה תעודת זהות - idnumber)';
$string['localsubjectuserfield'] = 'שם השדה בטבלת המשתמשים בו נשתמש כדי להשוות רשומות בבסיס הנתונים המרוחק (כלומר קוד הזיהוי) עבור הקצאת תפקיד ה-<i>subject</i>.';
$string['postypefield'] = 'שדה סוג תפקיד - שם השדה בטבלה החיצונית המתאר את סוג התפקיד שיש ליצור - ראשוני, משני או תפקיד מבוקש עתידי. אם זה אינו מוגדר, ההנחה היא שמדובר בהקצאת תפקיד ראשי.';
$string['remote_fields_mapping'] = 'מיפוי שדות בסיס נתונים';
$string['remoteobjectuserfield'] = 'שם השדה בטבלה המרוחקת בו נשתמש כדי להשוות רשומות לטבלת המשתמשים עבור הקצאת תפקיד ה-<i>object</i>.';
$string['remoteorgfield'] = 'שם השדה בטבלה המרוחקת בו אנו משתמשים לשיוך רשומות בבסיס נתוני הארגונים (למשל team).';
$string['remoteposfield'] = 'שם השדה בטבלה המרוחקת בו אנו משתמשים לשיוך רשומות בטבלת התפקידים (למשל position).';
$string['remotesubjectuserfield'] = 'שם השדה בטבלה המרוחקת בו נשתמש כדי להשוות רשומות לטבלת המשתמשים עבור הקצאת תפקיד ה-<i>subject</i>.';
$string['roleshortname'] = 'השם הקצר של התפקיד שיוקצה למנהל בהקשר של חבר צוות.';
$string['server_settings'] = 'הגדרות בסיס נתונים חיצוני';
$string['shortnamefield'] = 'השם הקצר של השדה בטבלה המרוחקת שישמש להקצאת שם קצר של שדה תפקיד.';
$string['useauthdb'] = 'השתמש באותן הגדרות עבור חיבור בסיס נתונים כמו שרכיב האימות של בסיס הנתונים משתמש (עדיין תצטרך לציין שם טבלה)';
$string['useenroldatabase'] = 'השתמש באותן הגדרות עבור חיבור בסיס נתונים כמו שרכיב השתמש באותן הגדרות עבור חיבור בסיס נתונים כמו שרכיב אימות בסיס הנתונים משתמש (עדיין תצטרך לציין שם טבלה)הרשמה של בסיס הנתונים משתמש (עדיין תצטרך לציין שם טבלה)';
$string['localrolefield'] = 'שם השדה בטבלת התפקידים בו נשתמש כדי להשוות רשומות בבסיס הנתונים המרוחק (כלומר שם קצר).'; // ORPHANED
$string['remoterolefield'] = 'שם השדה בטבלה המרוחקת בו נשתמש כדי להשוות רשומות לטבלת התפקידים.'; // ORPHANED

?>
