<?php
// enrol_manual.php - created with Totara langimport script version 1.1

$string['description'] = 'זוהי דרך ההרשמה שמשמשת כברירת המחדל. ישנן שתי דרכים עיקריות בהן יכול משתתף להירשם לקורס מסויים.
<ul>
<li>מנהל מערכת או מדריך יכולים לרשום את המשתתף באופן ידני על ידי קישור שנמצא בתפריט הנהלת הקורס (בתוך הקורס). </li>
<li>ניתן להגדיר להקורס סיסמה שידועה בתור \"מפתח הרשמה\", כל מי שיודע מהו המפתח יכול להוסיף את עצמו להקורס.</li>
</ul>';
$string['enrol_manual_requirekey'] = 'נדרש מפתח הרשמה של הקורס באזרוי למידה חדשים והימנעות מהסרת מפתחות קיימים.';
$string['enrol_manual_showhint'] = 'אפשר את הגדרה זו בכדי לחשוף את האות הראשונה של מפתח ההרשמה כרמז במידה ונרשם מפתח שגוי.';
$string['enrol_manual_usepasswordpolicy'] = 'השתמש במדיניות סיסמת משתמש נוכחית עבור מפתחות הרשמה של הקורס.';
$string['enrolmentkeyerror'] = 'מפתח הרשמה זה שגוי, אנא נסה שנית.';
$string['enrolname'] = 'הרשמה פנימית';
$string['keyholderrole'] = 'תפקידו של המשתמש השולט במפתח ההרשמה להקורס. התפקיד מוצג למשתתפים שמבקשים להרשם לאזןר הלמידה.';

?>
