<?PHP // $Id$
      // enrol_dbpositions.php - created with Moodle 1.9.11 (Build: 20110221) (2007101591.02)
      // local modifications from http://www.kineoisrael.com/totara


$string['dbhost'] = 'מספר או שם IP שרת';
$string['dbname'] = 'שם בסיס הנתונים';
$string['dbpass'] = 'סיסמת שרת';
$string['dbtable'] = 'טבלת בסיס נתונים';
$string['dbtype'] = 'סוג בסיס נתונים';
$string['dbuser'] = 'שם משתמש בשרת';
$string['description'] = 'באפשרותך להשתמש בבסיס נתונים חיצוני (מכמעט כל סוג שהוא) על מנת לנהל את היחסים בין משתמשים. ההנחה היא שבסיס הנתונים החיצוני מכיל שדות עם שני קודי זיהוי של משתמשים, וקוד זיהוי תפקיד. אלו ייבדקו מול שדות שתבחר בטבלאות משתמשים ותפקידים במערכת.';
$string['enrolname'] = 'בסיס נתונים חיצוני (יחסים בין משתמשים)';
$string['localobjectuserfield'] = 'שם השדה בטבלת המשתמשים בו נשתמש כדי להשוות רשומות בבסיס הנתונים המרוחק (כלומר קוד הזיהוי) עבור הקצאת תפקיד ה-<i>object</i>.';
$string['localrolefield'] = 'שם השדה בטבלת התפקידים בו נשתמש כדי להשוות רשומות בבסיס הנתונים המרוחק (כלומר שם קצר).';
$string['localsubjectuserfield'] = 'שם השדה בטבלת המשתמשים בו נשתמש כדי להשוות רשומות בבסיס הנתונים המרוחק (כלומר קוד הזיהוי) עבור הקצאת תפקיד ה-<i>subject</i>.';
$string['remote_fields_mapping'] = 'מיפוי שדות בסיס נתונים';
$string['remoteobjectuserfield'] = 'שם השדה בטבלה המרוחקת בו נשתמש כדי להשוות רשומות לטבלת המשתמשים עבור הקצאת תפקיד ה-<i>object</i>.';
$string['remoterolefield'] = 'שם השדה בטבלה המרוחקת בו נשתמש כדי להשוות רשומות לטבלת התפקידים.';
$string['remotesubjectuserfield'] = 'שם השדה בטבלה המרוחקת בו נשתמש כדי להשוות רשומות לטבלת המשתמשים עבור הקצאת תפקיד ה-<i>subject</i>.';
$string['server_settings'] = 'הגדרות בסיס נתונים חיצוני';
$string['useauthdb'] = 'השתמש באותן הגדרות עבור חיבור בסיס נתונים כמו שרכיב האימות של בסיס הנתונים משתמש (עדיין תצטרך לציין שם טבלה)';
$string['useenroldatabase'] = 'השתמש באותן הגדרות עבור חיבור בסיס נתונים כמו שרכיב השתמש באותן הגדרות עבור חיבור בסיס נתונים כמו שרכיב אימות בסיס הנתונים משתמש (עדיין תצטרך לציין שם טבלה)הרשמה של בסיס הנתונים משתמש (עדיין תצטרך לציין שם טבלה)';

?>
