<?PHP // $Id: enrol_manual.php,v 1.8 2009/02/18 08:51:59 emanuel1 Exp $
      // enrol_manual.php - created with Moodle 1.9.4+ (Build: 20090211) (2007101540)


$string['description'] = 'זוהי דרך ההרשמה שמשמשת כברירת המחדל. ישנן שתי דרכים עיקריות בהן יכול תלמיד להירשם לקורס מסויים.
<ul>
<li>מנהל או מורה יכולים לרשום את התלמיד באופן ידני על ידי קישור שנמצא בתפריט הנהלת הקורס (בתוך הקורס). </li>
<li>ניתן להגדיר לקורס סיסמה שידועה בתור \"מפתח הרשמה\", כל מי שיודע מהו המפתח יכול להוסיף את עצמו לקורס. </li>
</ul>';
$string['enrol_manual_requirekey'] = 'נדרש מפתח הרשמה של הקורס בקורסים חדשים והימנעות מהסרת מפתחות קיימים.';
$string['enrol_manual_showhint'] = 'אפשר את הגדרה זו בכדי לחשוף את האות הראשונה של מפתח ההרשמה כרמז במידה ונרשם מפתח שגוי.';
$string['enrol_manual_usepasswordpolicy'] = 'השתמש במדיניות סיסמת משתמש נוכחית עבור מפתחות הרשמה של הקורס.';
$string['enrolmentkeyerror'] = 'מפתח הרשמה זה שגוי, אנא נסה שנית.';
$string['enrolname'] = 'הרשמה פנימית';
$string['keyholderrole'] = 'תפקידו של המשתמש השולט במפתח ההרשמה לקורס. התפקיד מוצג לסטודנטים שמבקשים להרשם לקורס.';

?>
<?PHP // $Id$
      // enrol_manual.php - created with Moodle 1.9.5+ (Build: 20090624) (2007101550)



$string['description'] = 'זוהי דרך ההרשמה שמשמשת כברירת המחדל. ישנן שתי דרכים עיקריות בהן יכול משתתף להירשם לקורס מסויים.
<ul>
<li>מנהל מערכת או מדריך יכולים לרשום את המשתתף באופן ידני על ידי קישור שנמצא בתפריט הנהלת הקורס (בתוך הקורס). </li>
<li>ניתן להגדיר להקורס סיסמה שידועה בתור \"מפתח הרשמה\", כל מי שיודע מהו המפתח יכול להוסיף את עצמו להקורס.</li>
</ul>';
$string['enrol_manual_requirekey'] = 'נדרש מפתח הרשמה של הקורס באזרוי למידה חדשים והימנעות מהסרת מפתחות קיימים.';
$string['enrol_manual_usepasswordpolicy'] = 'השתמש במדיניות סיסמת משתמש נוכחית עבור מפתחות הרשמה של הקורס.';
$string['keyholderrole'] = 'תפקידו של המשתמש השולט במפתח ההרשמה להקורס. התפקיד מוצג למשתתפים שמבקשים להרשם לאזןר הלמידה.';

?>
