<?PHP // $Id: survey.php,v 1.8 2010/05/03 06:40:11 emanuel1 Exp $
      // survey.php - created with Moodle 1.9.8+ (Build: 20100407) (2007101580)


$string['actual'] = 'ממשי';
$string['actualclass'] = 'כיתה ממשית';
$string['actualstudent'] = '$a ממשי';
$string['allquestions'] = 'כל השאלות מסודרות לפי הסדר, כל התלמידים';
$string['allscales'] = 'כל סולמות הציונים, כל התלמידים';
$string['alreadysubmitted'] = 'כבר הגשת את הסקר הזה בעבר.';
$string['analysisof'] = 'ניתוח של $a';
$string['answers'] = 'תשובות';
$string['attls1'] = 'כשאני מעריך את הדברים שמישהו אומר, אני מתרכז בטיב הטיעון שלו ולא במי שמציג אותו.';
$string['attls10'] = 'חשוב לי להישאר כמה שיותר אובייקטיבי כשאני בוחן משהו.';
$string['attls10short'] = 'נשאר אובייקטיבי';
$string['attls11'] = 'אני מנסה לחשוב \'עם\' אנשים ולא נגדם.';
$string['attls11short'] = 'חושב עם אנשים.';
$string['attls12'] = 'יש לי קריטריונים מסוימים בהם אני משתמש כדי להעריך טיעונים שמוצגים לפני.';
$string['attls12short'] = 'משתמש בקריטריונים כדי להעריך.';
$string['attls13'] = 'סביר להניח שאני אנסה להבין את הדעה של האחר ולא אנסה להעריך אותה.';
$string['attls13short'] = 'מנסה להבין.';
$string['attls14'] = 'אני מנסה לחשוף נקודות תורפה בטיעונים של אחרים כדי לעזור להם להבהיר את הטיעונים שלהם.';
$string['attls14short'] = 'חושף נקודות תורפה';
$string['attls15'] = 'במהלך דיון על נושאים שנויים במחלוקת אני מנסה לשים את עצמי בצידם של אנשים אחרים כדי להבין מה הם חושבים ומדוע.';
$string['attls15short'] = 'שם את עצמי בצד שלהם.';
$string['attls16'] = 'ניתן לתאר את הדרך שבה אני מנתח כדברים כ\'מעמיד אותם לדין\' וזאת מפני שאני מקפיד לשקול את כל הראיות.';
$string['attls16short'] = 'מעמיד לדין';
$string['attls17'] = 'במהלך פיתרון בעיות אני מעריך את השימוש בהיגיון ובתבונה על פני התחשבות בדאגותיי האישיות.';
$string['attls17short'] = 'יותר מכל אני מעריך את ההיגיון.';
$string['attls18'] = 'על ידי שימוש באמפטיה אני יכול לקבל תובנה לתוך דעות השונות משלי.';
$string['attls18short'] = 'תובנה מתוך אפטיה.';
$string['attls19'] = 'כשאני פוגש אנשים בעלי דעות שונות משלי, אני עושה מאמץ מכוון כדי \'להאריך\' את עצמי אליהם כדי לנסות ולהבין איך הם יכולים להחזיק בדעות שלהם.';
$string['attls19short'] = 'עשה מאמץ כדי \'להאריך\'';
$string['attls1short'] = 'מתמקד על טיב הטיעון';
$string['attls2'] = 'אני נהנה לשחק את \'פרקליט השטן\' ולטעון את ההפך מטיעונו של האחר (בין אם זו דעתי או לא).';
$string['attls20'] = 'אני מבלה זמן בלהבין מה \'לא בסדר\' בדברים. לדוגמא,
בפירוש ספרותי אני אחפש אחר משהו שהטיעון שלא אינו טוב מספיק.';
$string['attls20short'] = 'מה לא בסדר?';
$string['attls2short'] = 'משחק את \'פרקליט השטן\'';
$string['attls3'] = 'אני אוהב להבין את המקום שממנו אנשים אחרים באים, מהם החוויות שגרמו להם להרגיש בדרך שבה הם מרגישים.';
$string['attls3short'] = 'המקום ממנו אנשים מגיעים';
$string['attls4'] = 'החלק הכי חשוב בהשכלה שלי היה ללמוד להבין אנשים מאוד שונים ממני.';
$string['attls4short'] = 'להבין אנשים שונים.';
$string['attls5'] = 'אני ממאמין שהדרך הטובה ביותר בה אני יכול לפתח זהות משלי, היא דרך אינטרקציה עם מגוון של אנשים.';
$string['attls5short'] = 'אינטרקציה עם מגוון אנשים';
$string['attls6'] = 'אני נהנה לשמוע דעות של אנשים שבאו מרקע שונה משלי, זה עוזר לי להבין איך ניתן לראות את אותו הדבר בדרכים שונות.';
$string['attls6short'] = 'נהנה לשמוע דעות';
$string['attls7'] = 'אני מוצא שאני יכול לחזק את עמדתי דרך ניהול וויכוחים עם מישהו שאינו מסכים איתי.';
$string['attls7short'] = 'מחזק את הטיעון שלי';
$string['attls8'] = 'אני תמיד מעוניין לדעת מדוע אנשים אומרים את הדברים שהם אומרים, ומאמינים בדברים בהם הם מאמינים.';
$string['attls8short'] = 'לדעת מדוע אנשים';
$string['attls9'] = 'פעמים רבות אני מוצא את עצמי מתווכח אם סופרים שאת ספריהם קראתי, כשאני מנסה להבין לפי ההגיון מדוע הם טעו.';
$string['attls9short'] = 'מתווכח עם סופרים';
$string['attlsintro'] = 'מטרת השאלון היא לעזור לנו להעריך את העמדות שלכם בנוגע ללמידה וחשיבה.

אין תשובות נכונות ולא נכונות, אנו מעוניינים אך ורק בדעה שלכם. היו בטוחים שאנו נתייחס לתשובותיכם בסודיות מלאה, ושהן לא ישפיעו על ההערכה שלכם בקורס.';
$string['attlsm1'] = 'עמדות בנוגע ללמידה וחשיבה.';
$string['attlsm2'] = 'למידה מחוברת';
$string['attlsm3'] = 'למידה נבדלת';
$string['attlsmintro'] = 'בזמן דיון.....';
$string['attlsname'] = 'ATTLS (גירסת 20 הפריטים)';
$string['ciq1'] = 'באיזה רגע במהלך הכיתה הרגשת הכי מעורב בתור לומד?';
$string['ciq1short'] = 'הכי מעורב';
$string['ciq2'] = 'באיזה רגע במהלך הכיתה הרגשת הכי מרוחק בתור לומד?';
$string['ciq2short'] = 'הכי מרוחק';
$string['ciq3'] = 'איזו פעולה שמישהו עשה בפורומים מצאת שהכי עזרה או הכי תמכה בך?';
$string['ciq3short'] = 'רגע עוזר';
$string['ciq4'] = 'איזו פעולה שמישהו עשה בפורומים מצאת שהיתה הכי מבלבלת או הכי תמוהה?';
$string['ciq4short'] = 'רגע מבלבל';
$string['ciq5'] = 'איזה אירוע הפתיע אותך יותר מכל?';
$string['ciq5short'] = 'רגע מפתיע?';
$string['ciqintro'] = 'ענה על התשובות למטה בזמן שאתה חושב על אירועים שקרו לאחרונה בכיתה.';
$string['ciqname'] = 'תקריות ביקורתיות';
$string['clicktocontinue'] = 'לחץ כאן כדי להמשיך';
$string['clicktocontinuecheck'] = 'לחץ כאן כדי לבדוק ואז להמשיך';
$string['colles1'] = 'הלמידה שלי מתמקדת על הנושאים שמעניינים אותי.';
$string['colles10'] = 'אני מבקש מתלמידים אחרים להסביר את הרעיונות שלהם.';
$string['colles10short'] = 'אני מבקש הסברים.';
$string['colles11'] = 'תלמידים אחרים מבקשים ממני להסביר את הרעיונות שלי.';
$string['colles11short'] = 'אני מתבקש להסביר.';
$string['colles12'] = 'תלמידים אחרים מגיבים לרעיונות שלי.';
$string['colles12short'] = 'תלמידים מגיבים אלי.';
$string['colles13'] = 'המורה מדרבן את החשיבה שלי.';
$string['colles13short'] = 'מורה מדרבן חשיבה.';
$string['colles14'] = 'המורה מעודד אותי להשתתף.';
$string['colles14short'] = 'המורה מעודד אותי.';
$string['colles15'] = 'המורה מעצב דיונים טובים.';
$string['colles15short'] = 'המורה מעצב דיונים.';
$string['colles16'] = 'המורה מעצב התבוננות עצמית ביקורתית.';
$string['colles16short'] = 'המורה מעצב התבוננות עצמית.';
$string['colles17'] = 'תלמידים אחרים מעודדים את השתתפותי.';
$string['colles17short'] = 'תלמידים מעודדים אותי';
$string['colles18'] = 'תלמידים אחרים מהללים את התרומה שלי.';
$string['colles18short'] = 'תלמידים מהללים אותי';
$string['colles19'] = 'תלמידים אחרים מעריכים את התרומה שלי.';
$string['colles19short'] = 'תלמידים מעריכים אותי';
$string['colles1short'] = 'התמקדות על נושאים מעניינים';
$string['colles2'] = 'מה שאני לומד חשוב לעיסוק המקצועי שלי.';
$string['colles20'] = 'תלמידים אחרים מזדהים עם המאבק שלי ללמוד.';
$string['colles20short'] = 'תלמידים מזדהים.';
$string['colles21'] = 'אני מצליח להבין היטב את הודעותיהם של התלמידים האחרים.';
$string['colles21short'] = 'אני מבין תלמידים אחרים';
$string['colles22'] = 'תלמידים אחרים מצליחים להבין היטב את הודעותי.';
$string['colles22short'] = 'תלמידים מבינים אותי';
$string['colles23'] = 'אני מצליח להבין היטב את ההודעות של המורה שלי.';
$string['colles23short'] = 'אני מבין את המורה';
$string['colles24'] = 'המורה מצליח להבין היטב את הודעותי.';
$string['colles24short'] = 'המורה מבין אותי.';
$string['colles2short'] = 'חשוב לעיסוק שלי';
$string['colles3'] = 'אני לומד כיצד אני יכול לשפר את העיסוק המקצועי שלי.';
$string['colles3short'] = 'משפר את העיסוק שלי.';
$string['colles4'] = 'מה שאני לומד מתחבר היטב לעיסוק המקצועי שלי.';
$string['colles4short'] = 'מתחבר לעיסוק שלי.';
$string['colles5'] = 'אני חושב באופן ביקורתי על הדרך שבה אני לומד.';
$string['colles5short'] = 'אני ביקורתי כלפי הלמידה שלי.';
$string['colles6'] = 'אני חושב באופן ביקורתי על הרעיונות שלי.';
$string['colles6short'] = 'אני ביקורתי כלפי הרעיונות שלי.';
$string['colles7'] = 'אני חושב באופן ביקורתי על הרעיונות של התלמידים האחרים.';
$string['colles7short'] = 'אני ביקורתי כלפי תלמידים אחרים.';
$string['colles8'] = 'אני חושב באופן ביקורתי על הרעיונות שנמצאים במה שאני קורא.';
$string['colles8short'] = 'אני ביקורתי כלפי מה שאני קורא.';
$string['colles9'] = 'אני מסביר את הרעיונות שלי לתלמידים האחרים.';
$string['colles9short'] = 'אני מסביר את הרעיונות שלי.';
$string['collesaintro'] = 'מטרת הסקר היא לעזור לנו להבין עד כמה ההעברה המקוונת של יחידה זו אפשרה לכם ללמוד.

כל אחת מ-24 ההצהרות למטה שואלת אתכם על החוויות שעברתם ביחידה זו.

אין תשובות נכונות ולא נכונות, אנו מעוניינים אך ורק בדעה שלכם. היו בטוחים שאנו נתייחס לתשובותיכם בסודיות מלאה, ושהן לא ישפיעו על ההערכה שלכם בקורס.

תשובותיכם המוקפדות יעזרו לנו לשפר להבא את הדרך שבה יחידה זו מוצגת ברשת, באופן מקוון.

אנו מודים לכם מקרב לב.';
$string['collesaname'] = 'COLLES (בפועל)';
$string['collesapintro'] = 'מטרת השאלון היא לעזור לנו להבין עד כמה ההעברה המקוונת של יחידה זו אפשרה לכם ללמוד.

כל אחת מ-24 ההצהרות למטה מבקשת מכם להשוות בין חוויות <b>מועדפות</b> (אידאליות) לבין חוויות <b>ממשיות</b> שחוויתם ביחידה זו.

אין תשובות נכונות ולא נכונות, אנו מעוניינים אך ורק בדעה שלכם. היו בטוחים שאנו נתייחס לתשובותיכם בסודיות מלאה, ושהן לא ישפיעו על ההערכה שלכם בקורס.

תשובותיכם המוקפדות יעזרו לנו לשפר להבא את הדרך שבה יחידה זו מוצגת ברשת, באופן מקוון.

אנו מודים לכם מקרב לב.';
$string['collesapname'] = 'COLLES (מועדף ובפועל)';
$string['collesm1'] = 'שייכות';
$string['collesm1short'] = 'שייכות';
$string['collesm2'] = 'חשיבה רפלקטיבית';
$string['collesm2short'] = 'חשיבה רפלקטיבית';
$string['collesm3'] = 'אינטרקטיביות';
$string['collesm3short'] = 'אינטרקטיביות';
$string['collesm4'] = 'תמיכת המורה';
$string['collesm4short'] = 'תמיכת המורה';
$string['collesm5'] = 'תמיכת החברים בקבוצה';
$string['collesm5short'] = 'תמיכת החברים בקבוצה';
$string['collesm6'] = 'פרשנות';
$string['collesm6short'] = 'פרשנות';
$string['collesmintro'] = 'ביחידה מקוונת זו....';
$string['collespintro'] = 'מטרת השאלון היא לעזור לנו להבין מה חשוב לכם ומה אתם מעריכים בחוויית למידה מקוונת.

כל אחת מ-24 ההצהרות למטה שואלת אתכם על החוויות <b>המועדפות</b> (אידאליות) שחוויתם ביחידה זו.

אין תשובות נכונות ולא נכונות, אנו מעוניינים אך ורק בדעה שלכם. היו בטוחים שאנו נתייחס לתשובותיכם בסודיות מלאה, ושהן לא ישפיעו על ההערכה שלכם בקורס.

תשובותיכם המוקפדות יעזרו לנו לשפר להבא את הדרך שבה יחידה זו מוצגת ברשת, באופן מקוון.

אנו מודים לכם מקרב לב.';
$string['collespname'] = 'COLLES (מועדף)';
$string['customintro'] = 'הקדמה מותאמת אישית';
$string['deleteallanswers'] = 'מחק את כל תגובות הסקר';
$string['deleteanalysis'] = 'מחק את ניתוח התגובה';
$string['done'] = 'גמור';
$string['download'] = 'הורד';
$string['downloadexcel'] = 'הורד את הנתונים כגיליון Excel';
$string['downloadinfo'] = 'ניתן להוריד את הנתונים הגולמיים המלאים לסקר זה בצורה המתאימה לניתוח ב- Excel, SPSS או כל יישום אחר.';
$string['downloadtext'] = 'הורד את הנתונים כקובץ טקסט פשוט.';
$string['editingasurvey'] = 'עריכת סקר';
$string['guestsnotallowed'] = 'אורחים לא מורשים להגיש סקרים';
$string['helpsurveys'] = 'עזרה על הסוגים השונים של הסקרים';
$string['howlong'] = 'כמה זמן לקח לך להשלים את הסקר?';
$string['howlongoptions'] = 'פחות מדקה 1, 1-2 דקות, 2-3 דקות, 3-4 דקות, 4-5 דקות, 5-10 דקות, יותר מ-10 דקות.';
$string['ifoundthat'] = 'מצאתי ש-';
$string['introtext'] = 'טקסט המבוא';
$string['ipreferthat'] = 'אני מעדיף ש-';
$string['modulename'] = 'תבניות סקרים מובנות';
$string['modulenameplural'] = 'סקרים';
$string['name'] = 'שם';
$string['newsurveyresponses'] = 'תגובות חדשות לסקר';
$string['nobodyyet'] = 'אף אחד עדיין לא השלים את הסקר';
$string['notdone'] = 'עדיין לא גמור';
$string['notes'] = 'ההערות והניתוח הפרטיים שלך.';
$string['othercomments'] = 'האם יש לך הערות נוספות להוסיף?';
$string['peoplecompleted'] = '$a אנשים השלימו את הסקר עד כה.';
$string['preferred'] = 'העדיף';
$string['preferredclass'] = 'הכיתה העדיפה';
$string['preferredstudent'] = '$a העדיף';
$string['question'] = 'שאלה';
$string['questions'] = 'שאלות';
$string['questionsnotanswered'] = 'חלק מהשאלות האמריקאיות לא נענו.';
$string['report'] = 'דוח הסקר';
$string['responses'] = 'תגובות';
$string['savednotes'] = 'ההערות שלך נשמרו';
$string['scaleagree5'] = 'מתנגד בתוקף,מתנגד מעט,לא מסכים ולא מתנגד,מסכים מעט,מסכים מאוד.';
$string['scales'] = 'סולמות ציונים';
$string['scaletimes5'] = 'כמעט ולעולם לא,לעתים רחוקות,לפעמים,לעתים תכופות,כמעט תמיד';
$string['seemoredetail'] = 'לחץ כאן כדי לראות פרטים נוספים';
$string['selectedquestions'] = 'השאלות שנבחרו מתוך סולם הציונים, כל התלמידים';
$string['summary'] = 'סיכום';
$string['survey:download'] = 'הורד תגובות';
$string['survey:participate'] = 'הגב לסקר';
$string['survey:readresponses'] = 'צפה בתגובות';
$string['surveycompleted'] = 'השלמת את הסקר. הגרף למטה מציג את סיכום התוצאות שלך בהשוואה לממוצע הכיתתי.';
$string['surveygraph'] = 'גרף הסקר.';
$string['surveyname'] = 'שם הסקר.';
$string['surveysaved'] = 'הסקר נשמר.';
$string['surveytype'] = 'סוג הסקר.';
$string['thanksforanswers'] = '$a, תודה שענית על הסקר.';
$string['time'] = 'זמן';
$string['viewsurveyresponses'] = 'ראה $a תגובות לסקר';

?>
