<h1>G&ouml;r inst&auml;llningar</h1>
<p>De f&ouml;ljande inst&auml;llningarna f&ouml;r betygs/omd&ouml;messtatistiken finns tillg&auml;ngliga fr&aring;n sidan "G&ouml;r inst&auml;llningar".</p>
<ul>

<li><b>Anv&auml;nd avancerade egenskaper:</b> Det h&auml;r aktiverar/avaktiverar de avancerade egenskaperna f&ouml;r betygs/omd&ouml;messtatistiken.
I normall&auml;get kan Du bara se po&auml;ng och summor utan kategorier eller specifika former f&ouml;r ber&auml;kning av betyg/omd&ouml;men.</li>

<li><b>Visa viktade betyg/omd&ouml;men:</b> Med det h&auml;r avg&ouml;r Du om viktade procent ska visas eller inte.
Du kan ocks&aring; v&auml;lja om studenter/elever/deltagare/l&auml;rande ska f&aring; se det. </li>

<li><b>Visa po&auml;ng:</b> Med det h&auml;r avg&ouml;r Du om po&auml;ngen ska visas eller inte. Du kan &auml;ndra inst&auml;llningarna f&ouml;r studenter/elever/deltagare/l&auml;rande separat fr&aring;n l&auml;rarvyn.</li>

<li><b>Visa procent:</b> Med det h&auml;r avg&ouml;r Du om procenten ska visas eller inte. Du kan &auml;ndra inst&auml;llningarna f&ouml;r studenter/elever/deltagare/l&auml;rande separat fr&aring;n l&auml;rarvyn.</li>

<li><b>Visa bokstavsbetyg:</b> Med det h&auml;r avg&ouml;r Du om samlade bokstavsbetyg f&ouml;r hela kursen ska visas eller inte. </li>

<li><b>Bokstavsbetyg: </b> Med det h&auml;r avg&ouml;r Du hur bokstavsbetyg ska ber&auml;knas antingen genom r&aring;a procent eller viktade procent.</li>

<li><b>Skriv om rubrikerna:</b> Med det h&auml;r avg&ouml;r Du hur ofta rubrikerna p&aring; kolumnerna ska skrivas om. D&auml;rmed kan Du l&auml;ttare sp&aring;ra en stor klass med studenter/elever/deltagare/l&auml;rande.</li>

<li><b>Visa dolda komponenter:</b> Det h&auml;r kommer att visa eller d&ouml;lja betygskomponenter som &auml;r dolda. Detta g&auml;ller bara f&ouml;r l&auml;rarvyn. 
Studenterna/eleverna/deltagarna/de l&auml;rande kommer inte att se n&aring;gra bidrag till betygs/omd&ouml;messtatistiken f&ouml;r komponenter som inte &auml;r synliga f&ouml;r dem. 
Studenternas/elevernas/deltagarnas/de l&auml;randes sammanlagda resultat kommer att innefatta dolda komponenter om detta &auml;r inst&auml;llt till "Ja".</li>
</ul>