<h1>Betyg/omd&ouml;men</h1>
<p>F&ouml;rsta g&aring;ngen som Du bes&ouml;ker sidan f&ouml;r Betyg/omd&ouml;men kommer den att visas i normalt eller enkelt l&auml;ge. Du kommer att se alla studenter/elever/deltagare/l&auml;rande, deras betyg/omd&ouml;men f&ouml;r alla betygssatta komponenter och ett sammanr&auml;knat resultat f&ouml;r varje student/elev/deltagare/l&auml;rande. </p> 
<ul>
<li>Du kan sortera p&aring;  student/elev/deltagare/l&auml;rande via efternamn eller f&ouml;rnamn genom att klicka p&aring; respektive l&auml;nkar under denna kolumn antingen p&aring; v&auml;nster eller h&ouml;ger sida. Sidan f&ouml;r Betyg/omd&ouml;men visas f&ouml;rst med sortering enligt efternamn. 
</li>
<li>Studenternas/elevernas/deltagarnas/de l&auml;randes namn &auml;r l&auml;nkar som kommer att visa just denne och dennes betyg/omd&ouml;men. Det h&auml;r &auml;r anv&auml;ndbart n&auml;r en student/elev/deltagare/l&auml;rande tittar p&aring;  sidan f&ouml;r Betyg/omd&ouml;men tillsammans med Dig och Du beh&ouml;ver skydda de andras integritet. 
</li>
<li>Knappen l&auml;ngst upp kan Du anv&auml;nda f&ouml;r att skapa ett kalkylblad av Excel-typ eller en tab-separerad textfil f&ouml;r de kursbetyg/omd&ouml;men som Du kan ladda ner till Din lokala dator.

</li>
<li>Huvudrubriken kommer att visa 'Betyg/omd&ouml;men' om Du anv&auml;nder normalt l&auml;ge. Annars kommer den att visa namnet p&aring; den kategori som Du f&ouml;r tillf&auml;llet visar, om Du har aktiverat avancerade inst&auml;llningar. 
</li>
<li>I mitten kommer Du att se alla betygssatta komponenter f&ouml;r en kurs (eller en specifik kategori i avancerat l&auml;ge).
Namnen p&aring; varje betygssatt komponent &auml;r l&auml;nkar som tar Dig till inst&auml;llningarna f&ouml;r den specifika komponenten.
</li>
<li>En kolumn f&ouml;r det sammanlagda resultatet hittar Du till h&ouml;ger om alla uppgifterna (eller kategorier i avancerat l&auml;ge).. Det finns ocks&aring; tv&aring; pilar till h&ouml;ger om rubriken f&ouml;r sammanlagt resultat som sorterar studenternas/elevernas/deltagarnas/de l&auml;randes sammanlagda resultat i fallande respektive stigande ordning.</li>
<li>Till h&ouml;ger om rubriken f&ouml;r det sammanlagda resultatet (eller f&ouml;r varje individuell kategori i avancerat l&auml;ge) &auml;r en 'stats' l&auml;nk som kommer att visa ett popup-f&ouml;nster med statistik baserat p&aring; sammanlagda resultat f&ouml;r klassen.
</li>
</ul>
<p>Hur Du modifierar specifika inst&auml;llningar f&ouml;r  sidan f&ouml;r Betyg/omd&ouml;men. L&auml;nken som Du beh&ouml;ver klicka p&aring; f&ouml;r att modifiera en inst&auml;llning kommer att ha dubbla citattecken. Mer 
information och hj&auml;lp hittar Du p&aring; varje respektive sk&auml;rm.</p>
<ul>
	<li><h3>Grundl&auml;ggande:</h3>
                <ul>
			<li>Att aktiver avancerat l&auml;ge: "G&ouml;r inst&auml;llningar" </li>
			<li>Att &auml;ndra hur ofta rubrikerna p&aring; kolumnerna upprepas : "G&ouml;r inst&auml;llningar"</li>
		</ul>
                </li>
	<li><h3>Avancerad:</h3>
		<ul>
			<li>Att modifiera vilka kolumner som ska visas: "G&ouml;r inst&auml;llningar"</li>
			<li>Att st&auml;lla in hur det sammanlagda betyget/omd&ouml;met ska ber&auml;knas: "G&ouml;r inst&auml;llningar"</li>
			<li>Att modifiera vilka kategorier en betygssatt komponent h&ouml;r till: "St&auml;ll in  kategorier"</li>
			<li>Betyg/omd&ouml;me f&ouml;r uppgifter i kurvformat: "St&auml;ll in  kategorier"</li>
			<li>Att st&auml;lla in en betygssatt komponent som ett extra tillgodor&auml;knande : "St&auml;ll in kategorier"</li>
			<li>Att l&auml;gga till en kategori: "St&auml;ll in kategorier"</li>
			<li>Att ta bort en kategori: "St&auml;ll in kategorier"</li>
			<li>Att st&auml;lla in viktning av betyg/omd&ouml;men: "St&auml;ll in viktning"</li>
			<li>Att r&auml;kna av de X l&auml;gsta betygen/omd&ouml;mena fr&aring;n en kategori : "St&auml;ll in viktning"</li>
			<li>Att l&auml;gga till bonuspo&auml;ng till en kategori: "St&auml;ll in viktning"</li>
			<li>Att g&ouml;mma kategorier fr&aring;n att visas p&aring; sidan f&ouml;r betyg/omd&ouml;men och ber&auml;kning: "St&auml;ll in viktning"</li>
			<li>Att st&auml;lla in skalan f&ouml;r betyg/omd&ouml;men och bokstavsbetyg: "St&auml;ll in bokstavsbetyg"</li>
</ul>
		</ul></li>
			<li>Att undanta studenter/elever/deltagare/l&auml;rande  fr&aring;n uppgifter: "Undantag fr&aring;n betyg/omd&ouml;men"</li>