<h1>Viktning</h1>
<p>H&auml;r kan Du st&auml;lla in viktningar av betyg/omd&ouml;men f&ouml;r en kategori likv&auml;l som att ta bort de X l&auml;gst v&auml;rderade uppgifterna fr&aring;n sammanr&auml;kningen av betyg/omd&ouml;men. Du kan l&auml;gga till bonuspo&auml;ng till en kategori, d&ouml;lja en kategori fr&aring;n att visas i samband med betyg och ber&auml;kning. </p>

<ul>
<li><b>Viktning:</b> Det h&auml;r g&ouml;r det m&ouml;jligt f&ouml;r Dig att vikta betyg/omd&ouml;men enligt kategori. Viktningen &auml;r den procentandel som en kategori ska utg&ouml;ra av ett betygs sammanlagda v&auml;rde.  Det sammanlagda v&auml;rdet kommer att visas l&auml;ngst ner i den gr&ouml;na texten om de sammanlagda viktningarna f&ouml;r alla kategorier uppg&aring;r till  100 och i den r&ouml;da om de inte g&ouml;r det. </li>

<li><b>Ta bort de X l&auml;gst v&auml;rderade :</b> Det h&auml;r anv&auml;nder Du f&ouml;r att ta bort de X l&auml;gst v&auml;rderade resultaten n&auml;r Du ber&auml;knar n&aring;gons betyg. Det sammanlagda v&auml;rdena av po&auml;ngen f&ouml;r en kategori b&ouml;r alla ha samma v&auml;rde f&ouml;r att undvika att of&ouml;ruts&auml;gbara resultat.</li>

<li><b>Bonuspo&auml;ng: </b>Det h&auml;r anv&auml;nder Du f&ouml;r att ge extra po&auml;ng som inte &auml;ndrar den sammanlagda po&auml;ngen f&ouml;r en kategori. Det h&auml;r kan Du anv&auml;nda f&ouml;r att justera f&ouml;r missvisande fr&aring;gor och liknande. Detta kommer att till&auml;mpas p&aring; alla studenter/elever/deltagare/l&auml;rande p&aring; samma s&auml;tt. Om Du vill dela ut extra po&auml;ng selektivt s&aring; f&aring;r Du l&auml;gga till en ny betygssatt komponent och ge extra po&auml;ng till den i 'St&auml;ll in kategorier'.</li>

<li><b>Dold:</b> Om den h&auml;r kryssrutan &auml;r markerad s&aring; kommer detta att ta bort en kategori fr&aring;n visning och ocks&aring; fr&aring;n ber&auml;kning av betyg/omd&ouml;men. Detta &auml;r ett enkelt s&auml;tt att l&auml;gga till komponenter till betygs/omd&ouml;messtatistiken f&ouml;rst efter det att de har blivit betygssatta. Eftersom betygssatta komponenter inte har placerats i n&aring;gon kategori kommer de automatiskt att registreras  som 'Inte kategoriserade'. Du kan st&auml;lla in kategorin 'Inte kategoriserade' till dold och sedan n&auml;r Du betygss&auml;tter komponenter kan Du flytta dem till vilken kategori Du vill och studenter/elever/deltagare/l&auml;rande kan se sina betyg/omd&ouml;men.</li>
</ul>