<?php

// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Strings for component 'lesson', language 'he', branch 'MOODLE_22_STABLE'
 *
 * @package   lesson
 * @copyright 1999 onwards Martin Dougiamas  {@link http://moodle.com}
 * @license   http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['accesscontrol'] = 'בקרת גישה';
$string['actionaftercorrectanswer'] = 'הפעולה לאחר תשובה נכונה';
$string['actionaftercorrectanswer_help'] = 'הפעולה המקובלת היא לעקוב אחר הקפיצה המתוארת בתשובה. ברוב המקרים הדבר יראה על העמוד הבא של השיעור. הסטדנט עובר על השיעור בדרך לוגית, מתחיל בתחילת השיעור ומסתיים בסופו.
בכל אופן, ניתן להשתמש במודול השיעור כסוג של מטלת * שקופית "פלאש" *.לסטודנט מוצגים מידע (אופציונלי) ושאלה בסדר רנדומלי בד"כ. אין קביעה של התחלה או קביעה של סוף. רק מוצגות קביעות של \*שקופיתים\* אחד אחרי השני בסדר שאיננו מיוחד.
אפשרות זו מותירה לשתי גרסאות דומות מאוד של התנהגות שקופיות "פלאש". האפשרות "הצג עמוד שלא נראה" לעולה לא מציגה את אותו עמוד פעמיים (גם אם הסטודנט **לא** ענה על השאלה הקשורה לשקופיתעמוד הנוכחי). האפשרות השניה (שאיננה ברירת מחדל) "הצג עמוד שלא נענה" מאפשר לסטודנט לצפות עמודים אשר כנראה הופיעו בעבר אך רק אם הם ענו על השאלה המקושרת בצורה שגויה.
בשקופית ה-"פלאש" וגם בסוג השיעור המורה יכול להחליט אם להשתמש בכל השקופיותעמודים שבשיעור או רק בתת-קביעה (רנדומלית). הדבר נעשה ע"י פרמטר " מספר העמודים (שקופיות) להצגה "';
$string['actions'] = 'פעולות';
$string['activitylink'] = 'קשר לפעילות';
$string['activitylink_help'] = '**קישור לפעילות**
התפריט הנפתח מכיל את כל הפעילויות שיש בקורס הזה. ביחרו כל פעילות שהיא מתוך הרשימה ובסוף השיעור יופיע קישור שיוביל אליה.';
$string['activitylinkname'] = 'עבור ל: {$a}';
$string['addabranchtable'] = 'הוסף דף תוכן מסתעף';
$string['addanendofbranch'] = 'הוסף סוף הסתעפות';
$string['addanewpage'] = 'הוסף דף חדש';
$string['addaquestionpage'] = 'הוסף דף';
$string['addaquestionpagehere'] = 'הוסף דף כאן';
$string['addbranchtable'] = 'הוסף טבלת הסתעפות';
$string['addcluster'] = 'הוסף אשכול';
$string['addedabranchtable'] = 'התווסף דף תוכן מסתעף';
$string['addedanendofbranch'] = 'התווסף סוף ההסתעפות';
$string['addedaquestionpage'] = 'התווסף דף';
$string['addedcluster'] = 'התווסף אשכול';
$string['addedendofcluster'] = 'התווסף סוף האשכול';
$string['addendofcluster'] = 'הוסף סוף אשכול';
$string['addpage'] = 'הוסף עמוד מסוג';
$string['anchortitle'] = 'תחילת תוכן עיקרי';
$string['and'] = 'ו';
$string['answer'] = 'תשובה';
$string['answeredcorrectly'] = 'נענה נכונה';
$string['answersfornumerical'] = 'לתשובות לשאלות מספריות צריך להתאים זוגות של ערכי מקסימום ומינמום.';
$string['arrangebuttonshorizontally'] = 'במצב \'מצגת\' לסדר את כפתורי ההסתעפות במאוזן?';
$string['attempt'] = 'ניסיון: {$a}';
$string['attempts'] = 'ניסיונות';
$string['attemptsdeleted'] = 'ניסיונות מחוקים';
$string['attemptsremaining'] = 'נשארו לך עוד {$a} ניסיונות';
$string['available'] = 'זמין החל מ-';
$string['averagescore'] = 'תוצאה ממוצעת';
$string['averagetime'] = 'זמן ממוצע';
$string['branch'] = 'הסתעף';
$string['branchtable'] = 'דף תוכן מסתעף';
$string['cancel'] = 'ביטול';
$string['cannotfindanswer'] = 'שגיאה: התשובה לא נמצאה';
$string['cannotfindattempt'] = 'שגיאה: הניביון לא נמצא';
$string['cannotfindessay'] = 'שגיאה: המאמר לא נמצא';
$string['cannotfindfirstgrade'] = 'שגיאה: לא נמצאו הציונים';
$string['cannotfindfirstpage'] = 'לא נמצא הדף הראשון';
$string['cannotfindgrade'] = 'שגיאה: לא נמצאו הציונים';
$string['cannotfindnewestgrade'] = 'שגיאה:  הציון החדש לא נמצא';
$string['cannotfindnextpage'] = 'גיבוי השיעור : הדף הבא לא נמצא';
$string['cannotfindpagerecord'] = 'הוספת סיום הסתעפות: רשומת הדף לא נמצאה';
$string['cannotfindpages'] = 'דפי השיעור לא נמצאו';
$string['cannotfindpagetitle'] = 'אשר מחיקה: כותרת הדף לא נמצאה';
$string['cannotfindpreattempt'] = 'רשומת הניסיון הקודם לא נמצאה!';
$string['cannotfindrecords'] = 'שגיאה: לא נמצאו רשומות השיעור';
$string['cannotfindtimer'] = 'לא ניתן היה למצוא את רשומות
lesson_timer';
$string['cannotfinduser'] = 'שגיאה: לא ניתן היה למצוא משתמשים';
$string['canretake'] = 'ה-{$a} יכול לנסות מחדש';
$string['casesensitive'] = 'השתמש בביטויים רגולריים';
$string['casesensitive_help'] = '**אפשרויות של שאלות**
לכמה מסוגי השאלות יש אפשרות שמופעלת על ידי לחיצה על תיבת הסימון. סוגי השאלות והמשמעויות שלהם, מפורטות למטה.

1.**שאלות אמריקאיות (שאלות רבות בחירה)**ישנה גירסא לשאלות האמריקאיות (רבות בחירה) הנקראת שאלות
**"אמריקאיות (רבות בחירה), מרובות תשובות"**. אם אתם בוחרים באפשרות זו, אז הסטודנט מחוייב לבחור בכל התשובות הנכונות מתוך מקבץ התשובות. בשאלה עצמה לאוו דווקא יאמר לסטודנט \*כמה\* תשובות נכונות ישנן. לדוגמא, השאלה: "מי מהאנשים הבאים כיהן כנשיא ארה"ב??" לא מודיעה לסטודנט כמה תשובות נכונות ישנן, לעומת השאלה: "בחרו מהרשימה הבאה את שני האנשים שכיהנו כנשיאי ארה"ב", שכן עושה זאת. מספר התשובות הנכונות יכול להיות כל ערך הכל מ**אחת** ועד למספר של כל האפשרויות שמתוכן ניתן לבחור.
{שאלה אמריקאית \'מרובת תשובות\' בעלת רק תשובה נכונה אחת **הינה** עדיין שונה משאלה אמריקאית (רב-ברירה) בגלל שהיא עדיין מאפשרת לסטודנט לבחור ביותר מתשובה אחת, בעוד שהשאלה האמריקאית (רב-ברירה) לא מאפשרת זאת כלל.}

2.
**תשובה קצרה** ישנן שתי מערכות השוואה שונות שניתן להשתמש בהן לשאלות מסוג \'תשובה קצרה\': המערכת הפשוטה ביותר משמשת כברירת המחדל. ניתן להשתמש במערכת ה"ביטוי הרגולרי", כל שצריך לעשות זה לסמן את תיבת הסימון של האפשרות "ביטוי רגולרי". למידע נוסף, אנא קיראו את קובץ העזרה: סוגי שאלות בשיעור.


שאר סוגי השאלות, לא עושות שימוש ב\'אפשרות השאלה\'.';
$string['checkbranchtable'] = 'בדוק את טבלת ההסתעפויות';
$string['checkedthisone'] = 'בדוק את זו';
$string['checknavigation'] = 'בדוק את הניווט';
$string['checkquestion'] = 'בדוק את השאלה';
$string['classstats'] = 'הנתונים הסטטיסטיים של הכיתה';
$string['clicktodownload'] = 'לחץ על הקישור הבא כדי להוריד את הקובץ';
$string['clicktopost'] = 'לחץ כאן כדי לפרסם את הציון שלך ברשימת התוצאות הגבוהות.';
$string['cluster'] = 'אשכול';
$string['clusterjump'] = 'שאלת אנסין בתוך אשכול';
$string['clustertitle'] = 'אשכול';
$string['collapsed'] = 'מצומצם';
$string['comments'] = 'ההערות שלך';
$string['completed'] = 'הושלם';
$string['completederror'] = 'השלם את השיעור';
$string['completethefollowingconditions'] = 'עלייך לעמוד בתנאי(ם) הבאים<b>{$a}</b> בשיעור לפני שתוכל להתקדם הלאה.';
$string['conditionsfordependency'] = 'התנאי(ם) לתלות';
$string['configactionaftercorrectanswer'] = 'פעולת ברירת המחדל שתופעל לאחר תשובה הכונה';
$string['configmaxanswers'] = 'ברירית המחדל של המספר המירבי של תשובות/הסתעפיות בדף';
$string['configmaxhighscores'] = 'מספר ציונים גבוהים שיוצג';
$string['configmediaclose'] = 'הצגת כפתור סגירה כחלק חלון קופץ המיוצר עבור קובץ מדיה מקושר';
$string['configmediaheight'] = 'מגדיר את הגובה של החלון הקופץ המוצג עבור קובץ מדיה מקושר';
$string['configmediawidth'] = 'מגדיר את הרוחב של החלון הקופץ המוצג עבור קובץ מדיה מקושר';
$string['configslideshowbgcolor'] = 'צבע הרקע למצגת אם היא מאופשרת';
$string['configslideshowheight'] = 'מגדיר את הגובה של המצגת אם מאופשרת';
$string['configslideshowwidth'] = 'הגדרת רוחב מצגת השיקופיות (באם היא מופעלת)';
$string['confirmdelete'] = 'מחק דף';
$string['confirmdeletionofthispage'] = 'אשר את המחיקה של עמוד זה';
$string['congratulations'] = 'איחולים לבבים - הגעת לסוף השיעור';
$string['continue'] = 'המשך';
$string['continuetoanswer'] = 'המשך לשנות את התשובות';
$string['continuetonextpage'] = 'המשך לעמוד הבא.';
$string['correctanswerjump'] = 'תקן את ה\'קפיצה\' של התשובה';
$string['correctanswerscore'] = 'ניקוד של תשובה נכונה';
$string['correctresponse'] = 'תגובה נכונה';
$string['credit'] = 'ניקוד';
$string['customscoring'] = 'ניקוד מותאם אישית';
$string['customscoring_help'] = '**ניקוד מותאם אישית**
אפשרות זו תאפשר לכם לתת ערך מספרי לנקודות של כל תשובה (לקבוע את מספר הנקודות שהתשובה מזכה).
לתשובות יכול להיות ערך חיובי וכמו כן גם ערך שלילי. לתשובות מיובאות יוקצה באופן אוטומטי ערך של נקודה אחת לתשובות נכונות וערך של 0 לתשובות לא נכונות, את זה אתם יכולים לשנות לאחר הייבוא.';
$string['deadline'] = 'מועד סופי להגשה';
$string['defaultessayresponse'] = 'המאמר שלך ייבדק על ידי המדריך של הקורס.';
$string['deleteallattempts'] = 'מוחק את כל נסיונות המענה';
$string['deletedefaults'] = '{$a} מחוקים x ברירת המחדל של השיעור';
$string['deletedpage'] = 'עמוד מחוק';
$string['deleting'] = 'מוחק';
$string['deletingpage'] = 'מוחק את עמוד: {$a}';
$string['dependencyon'] = 'תלוי ב-';
$string['dependencyon_help'] = '**תלות**
הגדרה זו מאפשרת להפוך את השתתפות הסטודנט בשיעור הנוכחי לתלויה ברמת ביצועיו בשיעור אחר (באותו הקורס). אם הסטודנט לא עומד בדרישות, אז הוא לא יוכל להיכנס לשיעור הזה.
הדרישות כוללות:
\* **|זמן:** על הסטודנט לבלות (לפחות) כמות זמן מוגדרת בשיעור הנדרש.
\* **|שלם:**על הסטודנט לסיים את השיעור הנדרש בשלמותו.
\* **|ציון יותר גבוה מאשר:**על הסטודנט לקבל בשיעור הנדרש ציון יותר גבוה מהציון שמפורט פה.

כשהדבר נדרש, אתם יכולים להשתמש בכל שילוב של הדרישות לעיל.';
$string['description'] = 'תיאור';
$string['detailedstats'] = 'סטטיסטיקה';
$string['didnotanswerquestion'] = 'לא ענה על השאלה.';
$string['didnotreceivecredit'] = 'לא קיבל את הניקוד.';
$string['displaydefaultfeedback'] = 'הצג את המשוב שמשמש כברירת מחדל';
$string['displaydefaultfeedback_help'] = '**הצג את המשוב שמשמש כברירת המחדל**
אם אפשרות זו נקבעת ל**כן**, אז, גם כאשר לא נמצאה תגובה לשאלה מסויימת, ישתמשו בתגובות שמשמשות כברירות המחדל: "זוהי התשובה הנכונה" ו"זוהי לא התשובה הנכונה".
אם אפשרות זו נקבעת ל**לא**,אז כאשר לא נמצאה תשובה לשאלה מסויימת, לא יוצג עליה משוב. הסטודנט שלומד את השיעור יופנה אוטומטית לעמוד הבא בשיעור.';
$string['displayhighscores'] = 'הצג את התוצאות הגבוהות';
$string['displayinleftmenu'] = 'להציג בתפריט השמאלי?';
$string['displayleftif'] = 'הצגת תפריט שמאלי רק כאשר הציון גדול מ:';
$string['displayleftif_help'] = 'הגדרה זו קובעת האם סטודנט חייב להגיע לציון מסויים לפני שהוא צופה בתפריט השמאלי. הדבר מכריח את הסטודנט לעבור על כל השיעור בנסיון הראשון שלו, ולאחר הגעה לציון הנדרש הוא יכול להשתמש ולצפות בתפריט השמאלי';
$string['displayleftmenu'] = 'הצג תפריט שמאלי';
$string['displayleftmenu_help'] = 'אפשרות זו תציג רשימה של העמודים (דף תוכן מסתעף) בשיעור זה.
בנוסף לכך, על ידי פירוט ציון הגבוה מאפס, משתמש הלוקח את שיעור זה לא יוכל לראו את התפריט השמאלי אם הוא אינו בעל ציון השווה או גבוה מהציון המפורט. מה מאפשר למעצבי שיעורים לכפות על המשתמשים לעבור דרך כל חלקי השיעור במהלך ניסיון המענה הראשון של הסטודנט. לאחר מכן, אם הסטודנט לוקח מחדש את השיעור לאחר שהוא מקבל את הציון הנדרש, הוא יכול לראות את התפריט השמאלי על מנת שיעזור לו במהלך העיון בתשובות.';
$string['displayofgrade'] = 'תצוגת הציון (לתלמידים בלבד)';
$string['displayreview'] = 'הצגת כפתור הסקירה';
$string['displayreview_help'] = '**הצג כפתור סקירה**
אם תבחרו את אפשרות זו, לאחר שסטודנט ענה לא נכונה על שאלה, יוצג כפתור שיאפשר לו לענות עליה שנית. אפשרות זו לא מתאימה לשאלות הדורשות חיבור מאמרים, אז אל תפעילו אותה אם אתם משתמשים בשאלות מסוג זה.';
$string['displayscorewithessays'] = 'עבור השאלות שנבדקות באופן אוטומטי קיבלת {$a->score} נקודות מתוך {$a->tempmaxgrade} .<br>
שאלת(ות) החיבור {$a->essayquestions}  שלך תבדק, והציון שתקבל עבורה יתווסף <br />במועד מאוחר יותר לחישוב של הציון הסופי שלך. <br /><br />
הציון הנוכחי שלך, מבלי שאלת(ות) החיבור הוא תוצאה של {$a->score} מתוך {$a->grade}.';
$string['displayscorewithoutessays'] = 'התוצאה שלך היא {$a->score} (מתוך {$a->grade}).';
$string['edit'] = 'ערוך';
$string['editingquestionpage'] = 'עריכת עמוד שאלה {$a}';
$string['editlessonsettings'] = 'ערוך את הגדרות השיעור';
$string['editpage'] = 'ערוך את תכני הדף';
$string['editpagecontent'] = 'ערוך את תכולת העמוד';
$string['email'] = 'דוא"ל';
$string['emailallgradedessays'] = 'שלח לכולם בדוא"ל <br />מאמרים בדוקים';
$string['emailgradedessays'] = 'שלח בדוא"ל מאמרים בדוקים';
$string['emailsuccess'] = 'הודעות דוא"ל נשלחו בהצלחה';
$string['emptypassword'] = 'הסיסמה איננה יכולה להיות ריקה';
$string['endofbranch'] = 'סוף ההסתעפות';
$string['endofcluster'] = 'סוף האשכול';
$string['endofclustertitle'] = 'סוף אשכול';
$string['endoflesson'] = 'סוף השיעור';
$string['enteredthis'] = 'הכניס את זה.';
$string['entername'] = 'הכנס כינוי חיבה לרשימת התוצאות הגבוהות.';
$string['enterpassword'] = 'בבקשה הכנס את הסיסמה:';
$string['eolstudentoutoftime'] = 'שים לב: נגמר לך הזמן המוקצב לשיעור זה. יכול להיות שהתשובה האחרונה שלך לא נספרה, אם ענית לאחר שהזמן נגמר.';
$string['eolstudentoutoftimenoanswers'] = 'לא ענית על אף שאלה. קיבלת ציון 0 עבור שיעור זה.';
$string['essay'] = 'מאמר';
$string['essayemailmessage'] = '<p>הוראות למאמר:<blockquote>{$a->question}</blockquote></p><p>תגובתך:<blockquote><em>{$a->response}</em></blockquote></p><p>{$a->teacher}\'s הערות:<blockquote><em>{$a->comment}</em></blockquote></p><p>קיבלת {$a->earned} מתוך {$a->outof} עבור שאלת מאמר זו.</p><p>
הציון שלך עבור שיעור זה שונה ל-{$a->newgrade}%.</p>';
$string['essayemailmessage2'] = '<p>נסיון מהיר:<blockquote>{$a->question}</blockquote></p><p>התגובות שלך:<blockquote><em>{$a->response}</em></blockquote></p><p>הערות נותן הציון:<blockquote><em>{$a->comment}</em></blockquote></p><p>קיבלת {$a->earned} מתוך {$a->outof} עבור שאלה מהירה זו.</p><p>ציון השיעור שלך השתנה ל-{$a->newgrade}%.</p>';
$string['essayemailsubject'] = 'הציון שלך עבור שאלה {$a}';
$string['essays'] = 'מאמרים';
$string['essayscore'] = 'ציון המאמר';
$string['fileformat'] = 'תסדיר הקובץ';
$string['finish'] = 'סיום';
$string['firstanswershould'] = 'על התשובה הראשונה \'לקפוץ\' לעמוד "נכון".';
$string['firstwrong'] = 'למרבה הצער, אינך יכול לזכות בנקודה זו מפני שהתשובה שלך היתה שגויה. האם תרצה להמשיך לנחש בשביל האושר שכרוך בלמידה (אבל ללא נקודות נוספות)?';
$string['flowcontrol'] = 'בקרת זרימה';
$string['full'] = 'מורחב';
$string['general'] = 'כללי';
$string['gotoendoflesson'] = 'דלג לסוף השיעור';
$string['grade'] = 'ציון';
$string['gradebetterthan'] = 'ציון טוב יותר מאשר (%)';
$string['gradebetterthanerror'] = 'הרווח ציון טוב יותר מ- {$a} אחוז';
$string['gradeessay'] = 'תן ציון לשאלות המאמרים ({$a->notgradedcount} עדיין לא נבדקו ו-{$a->notsentcount} לא נשלחו.)';
$string['gradeis'] = 'הציון הוא {$a}';
$string['gradeoptions'] = 'אפשרויות ציון';
$string['handlingofretakes'] = 'ניהול מקרים בהם הסטודנטים חוזרים על השיעור יותר מפעם אחת';
$string['handlingofretakes_help'] = '**ניהול מקרים בהם הסטודנטים חוזרים על אותו השיעור**
כאשר מאפשרים לסטודנטים לחזור על השיעור, אפשרות זו מאפשרת למורה להציג את הציון של השיעור ב(לדוגמא) עמוד הציון, או כ**ממוצע** (ממוצע בין הציון שהסטודנט קיבל במהלך הניסיון הראשון שלו ובין הציונים שהוא קיבל בנסיונות העוקבים), או כציון (שהוא קיבל בנסיון) **הטוב ביותר** של הסטודנט.

את אפשרות זו ניתן לשנות בכל עת.';
$string['havenotgradedyet'] = 'עדיין לא נבדק';
$string['here'] = 'הנה';
$string['highscore'] = 'תוצאה גבוהה';
$string['highscores'] = 'תוצאות גבוהות';
$string['hightime'] = 'זמן גבוה';
$string['importcount'] = 'ייבוא {$a} שאלות';
$string['importppt'] = 'ייבא PowerPoint';
$string['importppt_help'] = '**ייבוא PowerPoint HTML**
איך להשתמש
כל שקופיות PowerPoint מיובאות כטבלאות הסתעפויות (Branch Tables) עם תשובות הקודמות להן ותשובות הבאות לאחריהן.

1.פתחו את מצגת ה PowerPoint שלכם.
2.שימרו אותה כעמוד רשת (ללא אפשרויות מיוחדות).
3.התוצאה של השלב השלישי צריכה להיות קובץ html ותיקייה שמכילה את כל השקופיות כשהן מומרות לעמודי רשת.
כווצו התיקייה בלבד באמצעות תוכנת ZIP.
4.לכו לאתר המוודל שלכם והוסיפו שיעור חדש.
5.לאחר ששמרתם את הגדרות השיעור, צריכות להופיע בפניכם 4 אפשרויות תחת הכותרת "מה תרצו לעשות קודם?", ליחצו על "לייבא את PowerPoint".
6.השתמשו בכפתור ה"דפדף..." כדי למצוא את קובץ ה-ZIP שיצרתם בשלב 3. לאחר שמצאתם אותו ליחצו על "העלה את הקובץ הזה".
7.אם הכל עבד כמו שצריך, במסך הבא אמור להופיע בפניכם כפתור \'המשך\'.


אם היו לכם תמונות כלשהן ב-PowerPoint שלכם, הן היו אמורות להשמר כקבצי קורס ב-moddata/XY, כאשר ה-X הוא שם הקורס שלכם וה-Y הוא מספר (בדרך כלל 0). בנוסף לכך, במהלך תהליך הייבוא, נוצרים קבצים בתוך תיקיית נתוני מוודל שלכם, בתוך: temp/lesson. נכון לעכשיו, קבצים אלה לא נמחקים על ידי importppt.php.
 ';
$string['importquestions'] = 'ייבא שאלות';
$string['importquestions_help'] = '**ייבוא שאלות חדשות**
פונקציה זו מאפשרת לכם לייבא שאלות מקבצי טקסט חיצוניים, אותם מעלים דרך טופס.
הליך זה תומך במספר תסדירים של קבצים:

** תסדיר GIFT**
GIFT הינו תסדיר קובץ הייבוא הכי מקיף שבאמצעותו ניתן לייבא שאלות לבחנים של מוודל מתוך קבצי טקסט. הוא תוכנן להיות שיטה פשוטה למורים שכותבים את שאלותיהם בתוך קבצי טקסט. GIFT תומך בשאלות נכון/לא-נכון, שאלות אמריקאיות, שאלות בעלות תשובות קצרות, שאלות התאמה ושאלות בעלות תשובות מספריות, בנוסף לשאלות בתסדיר "המילה החסרה", בהם מחדירים \_\_\_|\_\__| . בקובץ טקסט יחיד ניתן לערבב מספר סוגים שונים של שאלות, ובנוסף לכך, התסדיר תומך בהערות, נתינת שמות לשאלות, משוב וציונים המבוססים על אחוזים והמשקל שניתן להם. הנה כמה דוגמאות:
מי קבור בקבר של גראנט?{~גראנט ~ג\'פרסון =אף אחד}
גראנט{~קבור =לקבור ~חי} בקבר של גראנט.
גראנט קבור בקבר של גראנט.{לא נכון}
מי קבור בקבר של גראנט?{=אף אחד =אף אחד לא}
מתי נולד יוליסס ס. גרנט (Ulysses S. Grant) ?{#1822}

[מידע נוסף על תסדיר ה"GIFT" ](help.php?file=formatgift.html&module=quiz)

**תסדיר Aiken**
Aiken הוא למעשה שיטה מאוד פשוטה ליצירת שאלות אמריקאיות על ידי שימוש בתסדיר מאוד ברור וקריא. הנה דוגמא לתסדיר הAiken:

מהי המטרה של עזרה ראשונה?
א. להציל חיים, למנוע פגיעה נוספת, לשמר בריאות טובה.
ב. לספק טיפול רפואי לכל אדם פצוע או פגוע.
ג. למנוע פגיעה נוספת
ד. לעזור לקורבנות שמחפשים עזרה.
תשובה: א

[מידע נוסף על תסדיר ה"Aiken" format](help.php?file=formataiken.html&module=quiz)

**מילה חסרה**
תסדיר זה תומך רק בשאלות אמריקאיות. כל תשובה מופרדת על ידי טילדה (~), ולתשובה הנכונה מוספת תחילית של סימן שווה (=). הנה דוגמא:
 מהרגע שאנו מתחילים לחקור את חלקי גופנו כתינוקות, אנו הופכים לתלמידים של {=אנטומיה ופיזיולוגיה ~מדע ~רפלקסולוגיה ~ניסוי}, ובמובן מסויים אנו נישארים תלמידים לאורך כל החיים.

[מידע נוסף על התסדיר "מילה חסרה](help.php?file=formatmissingword.html&module=quiz)

**AON**
תסדיר זה זהה לתסדיר "מילה חסרה", מלבד מה שקורה לאחר ייבוא השאלות. אז, כל שאלות התשובות הקצרות הופכות, ארבע בכל פעם, לשאלות התאמה.
בנוסף, בזמן הייבוא, התשובות לשאלות האמריקאיות מעורבבות בינן לבין עצמן (באופן רנדומלי).
תסדיר זה נקרא אחר ארגון שמימן פיתוח של תכונות בחנים רבות.

**Blackboard**
מודול זה יכול לייבא שאלות שנשמרו בתסדיר הייצוא של Blackboard. הוא מסתמך על כך שפונקציות XML יעברו קומפילציה לתוך הPHP שלכם.

[מידע נוסף על תסדיר "Blackboard" ](help.php?file=formatblackboard.html&module=quiz)

**Course Test Manager (מנהל מבחני הקורס)**
מודול זה יכול ליבא שאלות שנשמרו במאגר (בנק) המבחנים של Course Test Manager (מנהל מבחני הקורס). לפי שרת האינטרנט עליו רץ מוודל (Windows או Linux) הוא מסתמך על דרכי גישה שונות למאגר המבחנים, שנמצא בתוך בסיס נתונים של Microsoft Access.
על Windows הוא מאפשר לכם להעלות את בסיס הנתונים אליו נכנסתם בדיוק כמו כל נתוניו של קובץ מיובא אחר.
על Linux, עליכם להגדיר מכונת windows על אותה הרשת בעלת אותו בסיס הנתונים של Course Test Manager(מנהל מבחני הקורס), ותוכנה שנקראת ODBC Socket Server (קישור פתוח למאגרי נתונים, תקן של מיקרוסופט המאפשר גישה למאגרי נתונים מכל יישום ודרך כל מערכת ניהול נתונים של המאגר) שעושה שימוש בXML על מנת להעביר נתונים למוודל על השרת של Linux.

אנא קיראו את קובץ העזרה המלא שמופיע למטה, לפני שאתם משתמשים במחלקת ייבוא זו.
[מידע נוסף על תסדיר ה"CTM" ](help.php?file=formatctm.html&module=quiz)

**מותאם אישית**
אם יש לכם תסדיר משלכם שאתם צריכים לייבא, אתם יכולים ליישם אותו בעצמכם על ידי עריכתquiz/format/custom.php.

כמות הקוד החדש הנדרשת היא די קטנה - מספיקה בדיוק כדי לנתח שאלה יחידה מתוך טקסט נתון.

["מידע נוסף על תסדיר "בהתאמה אישית](help.php?file=formatcustom.html&module=quiz)

תסדירים נוספים עתידים לבוא, והם כוללים WebCT, IMS QTI, וכל דבר אחר שמשתמשי מוודל יכולים לתרום!';
$string['insertedpage'] = 'עמוד מושתל';
$string['invalidfile'] = 'קובץ לא חוקי';
$string['invalidid'] = 'לא הועברו  מספרי זיהוי הרכיב של הקורס או מספרי זיהוי של השיעור';
$string['invalidlessonid'] = 'קוד השיעור איננו נכון';
$string['invalidpageid'] = 'קוד דף איננו חוקי';
$string['jump'] = 'קפיצה';
$string['jumps'] = 'קפיצות';
$string['jumps_help'] = '**קישור ה"קפוץ ל"**
לכל תשובה (לשאלה) או תיאור (לעמודי הסתעפויות) מחובר קישור \'קפוץ ל\'. כאשר התשובה נבחרה, תגובת התשובה מוצגת לסטודנט. לאחר מכן, הסטודנט נשלח לעמוד שנקבע בקישור ה\'קפוץ ל\'. הקישור יכול להיות יחסי או מוחלט. קישורים יחסיים הם **העמוד הזה** ו**העמוד הבא** .**העמוד הזה** משמעותו שהסטודנט רואה שוב את העמוד הנוכחי. **העמוד הבא** מראה את העמוד הבא העוקב אחר העמוד הזה בסדר הלוגי של העמודים. קישור מוחלט (לעמוד) נקבע על ידי בחירה ב**כותרת** של העמוד.
שימו לב שקישור \'קפוץ ל\' **עמוד הבא** (קישור יחסי), יכול להפנות לעמוד שונה לאחר שהעמודים שינו מקום. זאת לעומת קישור \'קפוץ ל\' שמשתמש ב**כותרות** של עמודים, ולכן תמיד יראו את אותו העמוד גם לאחר שהעמודים עברו מקום.
קפיצות מיוחדות
שאלת "אנסין" (קטע טקסט שלא נלמד) בתוך הסתעפות
אפשרות זו תקשר לשאלת "אנסין" שנבחרה באופן שרירותי (על ידי הסטודנט בניסיון זה) בין טבלת הסתעפות זו וסוף השיעור או \'סוף ההסתעפות\' הבא.

שאלה שרירותית בתוך הסתעפות
אפשרות זו תקשר לשאלה שנבחרה באופן שרירותי בין טבלת ההסתעפות הנוכחית וסוף השיעור, או \'סוף ההסתעפות\' הבא.
אם הסטודנט כבר ראה את השאלה ו(מספר) הניסיונות גדול מ-1, תהיה לו אפשרות נוספת להרוויח את הנקודות של השאלה ההיא. אם (מספר) הניסיונות נקבע ל-1, אז שאלה זו תושמט, ובמקומה תוצג שאלה שרירותית אחרת.

טבלת הסתעפות שרירותית
אפשרות זו תקפוץ באופן שרירותי לטבלת הסתעפות שנמצאת בין טבלת ההסתעפות הנוכחית וסוף השיעור, או \'סוף ההסתעפות\' הבא.';
$string['jumpsto'] = 'קפיצות ל-<em>{$a}</em>';
$string['leftduringtimed'] = 'עזבת באמצע שיעור מתוזמן.<br />אנא לחץ על \'המשך\' בשביל להתחיל מחדש את השיעור.';
$string['leftduringtimednoretake'] = 'עזבת באמצע שיעור מתוזמן <br />ואינך מורשה לחזור עליו או להמשיך אותו.';
$string['lesson:edit'] = 'ערוך פעילות של שיעור';
$string['lesson:manage'] = 'נהל פעילות של שיעור';
$string['lessonattempted'] = 'נסיון לשיעור';
$string['lessonclosed'] = 'שיעור זה נסגר ב- {$a}.';
$string['lessoncloses'] = 'השיעור נסגר';
$string['lessoncloseson'] = 'שיעור נסגר ב {$a}';
$string['lessonformating'] = 'עיצוב השיעור';
$string['lessonmenu'] = 'תפריט השיעור';
$string['lessonnotready'] = 'השיעור לא מוכן שיתחילו בו. אנא צור קשר עם ה-{$a} שלך.';
$string['lessonnotready2'] = 'שיעור זה עדיין לא מוכן';
$string['lessonopen'] = 'השיעור שלך ייפתח ב-{$a}.';
$string['lessonopens'] = 'השיעור נפתח.';
$string['lessonpagelinkingbroken'] = 'העמוד הראשון לא נמצא. הקישורים שבין עמודי השיעור כנראה נשברו. אנא צור קשר עם מנהל.';
$string['lessonstats'] = 'הנתונים הסטטיסטיים של השיעורים.';
$string['linkedmedia'] = 'מדיה מקושרת';
$string['loginfail'] = 'ההתחברות נכשלה, אנא נסה שנית.....';
$string['lowscore'] = 'תוצאה נמוכה.';
$string['lowtime'] = 'זמן נמוך';
$string['manualgrading'] = 'בדיקה ומתן ציון למאמרים';
$string['matchesanswer'] = 'התאמה עם התשובה';
$string['matching'] = 'התאמה';
$string['matchingpair'] = 'נמצא הזוג {$a}';
$string['maxgrade'] = 'ציון מירבי';
$string['maxgrade_help'] = '**הציון של השיעור**
ערך זה קובע מהו הציון המירבי שניתן להעניק בשיעור זה, כאשר הטווח נע בין 0 ל100%. את ערך זה ניתן לשנות בכל עת במהלך השיעור. לכל שינוי יש השפעה מיידית על עמוד הציונים ועל הציונים שמוצגים בפני הסטודנטים ברשימות השונות. אם הערך נקבע כ-0, אז השיעור לא יופיע באף אחד מעמודי הציונים.';
$string['maxhighscores'] = 'מספר התוצאות הגבוהות המוצגות';
$string['maximumnumberofanswersbranches'] = 'מספר מירבי של תשובות או הסתעפויות';
$string['maximumnumberofanswersbranches_help'] = '**המספר המירבי של תשובות בשיעור**
ערך זה קובע את מספר התשובות המקסימילי בהן יכול המורה להשתמש. ערך ברירת המחדל הוא 4. אם השיעור עושה שימוש בלעדי ב, נגיד, שאלות נכוןלא נכון לכל אורכו, אז הגיוני לקבוע את הערך הזה ל-2.

פרמטר זה קובע גם כן את המספר המירבי של הסתעפויות בהן ניתן להשתמש בדף תוכן מסתעף.

את הפרמט הזה ניתן לשנות בביטחה בכל שיעור בעל תוכן קיים. למעשה, במקרה ותרצו להוסיף שאלה מרובת אפשרויות או דף תוכן מסתעף ארוך, אתם תהיו חייבים לשנות את הפרמטר הזה. לאחר שהוספתם את השאלה (החריגה) או את טבלת ההסתעפויות (BranchTable), אתם יכולים להנמיך את הערך הזה למשהו מעט יותר "סטנדרטי".';
$string['maximumnumberofattempts'] = 'מספר מירבי של נסיונות';
$string['maximumnumberofattempts_help'] = 'הגשה זו מציינת את המספר המירבי של נסיונות המאופשרות עבור כל שאלה.
במידה והתשובה שגויה שוב ושוב, כשהערך המירבי מגיע, העבוד הבא של השיעור יופיע.';
$string['maximumnumberofattemptsreached'] = 'הושג המספר המירבי של נסיונות - עובר לעמוד הבא';
$string['maxtime'] = 'הגבלת זמן (דקות)';
$string['maxtimewarning'] = 'יש לך {$a} דקה(ות) כדי לסיים את השיעור';
$string['mediaclose'] = 'הראה את כפתור \'סגור\':';
$string['mediafile'] = '\'חלון קופץ\' לקובץ או עמוד ברשת';
$string['mediafile_help'] = '**קובץ או עמוד רשת \'קופץ\'**
אפשרות זו תיצור חלון \'קופץ\' בתחילתו של השיעור שיוביל לקובץ (לדוגמא: קובץ mp3) או לעמוד ברשת.
בנוסף לכך, על כל עמוד של השיעור יופיע קישור שפותח מחדש את החלון ה\'קופץ\', במידה ויש בכך צורך.

לבחירתכם, ניתן להוסיף כפתור "סגור חלון" בתחתית החלון ה\'קופץ\'. בנוסף, ניתן לקבוע את רוחב ואורך החלון.
אפשרות זו תומכת בסוגי הקבצים המשובצים הבאים:
* MP3
* Media Player
* Quicktime
* Realmedia
* HTML
* Plain Text (טקסט רגיל)
* GIF
* JPEG
* PNG

כברירת מחדל, כל סוגי הקבצים האחרים יופיעו כקישור להורדת הקובץ.';
$string['mediafilepopup'] = 'לחץ כאן על מנת לראות את קובץ המדיה של השיעור.';
$string['mediaheight'] = 'גובה החלון הקופץ';
$string['mediawidth'] = 'רוחב החלון הקופץ';
$string['messageprovider:graded_essay'] = 'הודעת מתן הציון למאמר';
$string['minimumnumberofquestions'] = 'מספר מיזערי של שאלות';
$string['minimumnumberofquestions_help'] = '**מספר השאלות המינמלי בשיעור**
לרוב רצוי שהמורה יקבע את הפרמטר הזה כשהשיעור מכיל דף תוכן מסתעף אחת או יותר. ערך זה קובע את (גבול) מינמום השאלות שנראות בזמן חישוב הציון. הוא **לא** כופה על הסטודנטים לענות על מספר זה של שאלות במהלך השיעור.
לדוגמא, אם תקבעו את הפרמטר הזה כ 20, אתם תבטיחו שהציונים ייתנו כאילו הסטודנטים ראו **לפחות** מספר זהה של שאלות (20). בואו ניקח לדוגמא את המיקרה הבא, בוא סטודנט מסתכל רק על הסתעפות אחת בשיעור. בהסתעפות זו יש, למשל, חמישה עמודים, והסטודנט עונה על כל השאלות המשוייכות אליהן בצורה נכונה. לאחר מכן, הסטודנט בוחר לסיים את השיעור (בהנחה שהאפשרות הזו קיימת בדף תוכן מסתעף "ברמה הגבוהה ביותר", הנחה הגיונית למדי). אם הפרמטר הזה נישאר ללא הגדרה, אז הציון שהסטודנט הנל יקבל יהיה 5 מתוך 5, כלומר 100%.
לעומת זאת, אם הפרמטר הזה נקבע ל 20, הציון של הסטודנט הנל ירד ל5 מתוך 20, כלומר 25%. ובמקרה נוסף, של סטודנט אחר, שעבר על כל ההסתעפויות, וראה, למשל, 25 עמודים בהם הוא ענה על כל השאלות, מלבד שתיים, בצורה נכונה, הציון שלו יהיה 23 מתוך 25, כלומר 92%.
אם אתם משתמשים בפרמטר הזה, בעמוד הראשון של השיעור עליכם לכתוב משהו כמו:

> בשיעור זה מצפים מכם לנסות ולענות על לפחות X שאלות. אתם יכולים לנסות ולענות על יותר שאלות אם אתם רוצים בכך. לעומת זאת, אם תנסו לפתור פחות מX שאלות, הציון שלכם עדיין יחושב כאילו ניסיתם לפתור X שאלות.
>
כמובן, שבקטע לעיל ה"X" מוחלף על ידי הערך הממשי שניתן לפרמטר זה.

כשהפרמטר הזה הוגדר, מודיעים לסטודנטים על כמה שאלות הם כבר ניסו לענות ועל כמה שאלות מצפים מהם לנסות ולענות.';
$string['missingname'] = 'אנא הכנס כינוי';
$string['modattempts'] = 'אפשר סקירה נוספת של הסטודנט';
$string['modattempts_help'] = '**אפשר לסטודנטים לשקול שוב**
אפשרות זו תאפשר לסטודנטים לנווט בחזרה דרך השיעור כדי לשנות את התשובות שלהם.';
$string['modattemptsnoteacher'] = 'סקירת סטודנטים עובדת רק בשביל סטודנטים.';
$string['modulename'] = 'שיעור';
$string['modulename_help'] = 'השיעור מעביר תוכן בצורה מעניינת וגמישה. הוא מורכב ממספר עמודים. כשבדרך כלל, כל עמוד מסתיים בשאלה בעלת מספר תשובות אפשריות. לפי התשובה שהסטודנט נותןהוא, או ממשיך לעמוד הבא או, נלקח חזרה לעמוד הקודם.
ניווט דרך השיעור יכול להיות ישיר ופשוט או מורכב, הדבר תלוי ברובו על מבנה החומר המוצג.';
$string['modulenameplural'] = 'שיעורים';
$string['move'] = 'הזז דף';
$string['movedpage'] = 'העמוד הועבר';
$string['movepagehere'] = 'העבר את העמוד לכאן';
$string['moving'] = 'מעביר את העמוד: {$a}';
$string['multianswer'] = 'תשובות מרובות';
$string['multianswer_help'] = '**אפשרויות של שאלות**
לכמה מסוגי השאלות יש אפשרות שמופעלת על ידי לחיצה על תיבת הסימון. סוגי השאלות והמשמעויות שלהם, מפורטות למטה.

1.**שאלות אמריקאיות (שאלות רבות בחירה)**ישנה גירסא לשאלות האמריקאיות (רבות בחירה) הנקראת שאלות
**"אמריקאיות (רבות בחירה), מרובות תשובות"**. אם אתם בוחרים באפשרות זו, אז הסטודנט מחוייב לבחור בכל התשובות הנכונות מתוך מקבץ התשובות. בשאלה עצמה לאוו דווקא יאמר לסטודנט \*כמה\* תשובות נכונות ישנן. לדוגמא, השאלה: "מי מהאנשים הבאים כיהן כנשיא ארה"ב??" לא מודיעה לסטודנט כמה תשובות נכונות ישנן, לעומת השאלה: "בחרו מהרשימה הבאה את שני האנשים שכיהנו כנשיאי ארה"ב", שכן עושה זאת. מספר התשובות הנכונות יכול להיות כל ערך הכל מ**אחת** ועד למספר של כל האפשרויות שמתוכן ניתן לבחור.
{שאלה אמריקאית \'מרובת תשובות\' בעלת רק תשובה נכונה אחת **הינה** עדיין שונה משאלה אמריקאית (רבת בחירה) בגלל שהיא עדיין מאפשרת לסטודנט לבחור ביותר מתשובה אחת, בעוד שהשאלה האמריקאית (רבת הבחירה) לא מאפשרת זאת כלל.}

2.
**תשובה קצרה** ישנן שתי מערכות השוואה שונות שניתן להשתמש בהן לשאלות מסוג \'תשובה קצרה\': המערכת הפשוטה ביותר משמשת כברירת המחדל. ניתן להשתמש במערכת ה"ביטוי הרגולרי", כל שצריך לעשות זה לסמן את תיבת הסימון של האפשרות "ביטוי רגולרי". למידע נוסף, אנא קיראו את קובץ העזרה: סוגי שאלות בשיעור.


שאר סוגי השאלות, לא עושות שימוש ב\'אפשרות השאלה\'.';
$string['multichoice'] = 'בחירה מרובה';
$string['multipleanswer'] = 'תשובות מרובות';
$string['nameapproved'] = 'שם מאושר';
$string['namereject'] = 'סליחה, השם שלך נדחה על ידי המסנן.<br />אנא נסה שם אחר.';
$string['new'] = 'חדש';
$string['nextpage'] = 'העמוד הבא';
$string['noanswer'] = 'לא ניתנה תשובה';
$string['noattemptrecordsfound'] = 'לא נימצאו רשומות של ניסיונות: לא ניתן ציון.';
$string['nobranchtablefound'] = 'לא נמצא דף תוכן מסתעף';
$string['nocommentyet'] = 'עדיין אין הערות.';
$string['nocoursemods'] = 'לא נמצאו פעילויות';
$string['nocredit'] = 'אין נקודות.';
$string['nodeadline'] = 'אין מועד סופי';
$string['noessayquestionsfound'] = 'לא נמצאו שאלות מאמר בשיעור זה.';
$string['nohighscores'] = 'אין תוצאות גבוהות.';
$string['nolessonattempts'] = 'לא נעשו נסיונות מענה לשיעור זה.';
$string['nooneansweredcorrectly'] = 'אף אחד לא ענה נכונה.';
$string['nooneansweredthisquestion'] = 'שאלה זו לא נענתה על ידי אף אחד.';
$string['noonecheckedthis'] = 'אף אחד לא סימן את זה.';
$string['nooneenteredthis'] = 'אף אחד לא הכניס את זה.';
$string['noonehasanswered'] = 'אף אחד לא ענה עדיין על שאלת מאמר.';
$string['noretake'] = 'אתה לא מורשה לחזור על שיעור זה.';
$string['normal'] = 'עקוב אחר נתיב השיעור';
$string['notcompleted'] = 'לא גמור';
$string['notdefined'] = 'לא מוגדר';
$string['nothighscore'] = 'עדיין לא הצלחת להיכנס לרשימת {$a} התוצאות הכי גבוהות.';
$string['notitle'] = 'אין כותרת';
$string['numberofcorrectanswers'] = 'מספר התשובות הנכונות: {$a}';
$string['numberofcorrectmatches'] = 'מספר ההתאמות הנכונות: {$a}';
$string['numberofpagestoshow'] = 'מספר העמודים (שקופיות) שיש להראות';
$string['numberofpagestoshow_help'] = 'שימוש במשתנה זה אך ורק בשיעורים עם סוג שקופית פלאש. ערך ברירת המחדל הוא 0 כך שכל העמודיםשקופיות גלויים בשיעור. קביעת משתנה זה לערך הגדול מאפס יציג את מספר העמודים כמספר הנבחר. לאחר שמספר עמודיםשקופיות יוצגו סוף השיעור יושג כאשר כל העמודים יופיעו.
אם משתנה זה נקבע לערך הגדול ממספר העמודים בשיעור, סוף השיעור יושג כאשר כל העמודים יופיעו.';
$string['numberofpagesviewed'] = 'מספר השאלות שנענו: {$a}';
$string['numberofpagesviewednotice'] = 'מספר התשובות שנענו: {$a->nquestions}; (עליך לענות על {$a->minquestions} שאלות לפחות.)';
$string['numerical'] = 'מספרי';
$string['ongoing'] = 'הצג את התוצאה המצטברת';
$string['ongoing_help'] = '**תוצאה מצטברת**
כאשר אפשרות זו מופעלת, כל עמוד יציג את הנקודות שהסטודנט צבר עד כה, מתוך הסכום הכולל האפשרי (עד כה). לדוגמא: הסטודנט ענה נכונה על ארבע שאלות, שכל אחת מהן מזכה אותו ב5 נקודות, וטעה בשאלה אחת. התוצאה המצטברת תקליד שהסטודנט הרוויח עד כה 15/20 נקודות.';
$string['ongoingcustom'] = 'הרווחת {$a->score} נקודה(ות) מתוך {$a->currenthigh} נקודה(ות) עד כה.';
$string['ongoingnormal'] = 'ענית על {$a->correct} נכונה מתוך {$a->viewed} ניסיונות.';
$string['onpostperpage'] = 'פרסום אחד בלבד לכל ציון';
$string['options'] = 'אפשרויות';
$string['or'] = 'או';
$string['ordered'] = 'הוזמן';
$string['other'] = 'אחר';
$string['outof'] = 'מתוך {$a}';
$string['overview'] = 'סקירה כללית';
$string['overview_help'] = '**סקירה כללית**

1.שיעור מורכב ממספר **עמודים**, ובנוסף מ**דפי תוכן מסתעפים
**,לפי בחירתכם.
2.עמוד מכיל בתוכו **תוכן** כלשהו, ומסתיים, על פי רוב, ב**שאלה**.
מכאן המונח, **עמוד שאלה**.
3.לשאלות מאמר, אין תשובה, ישנם רק תוצאה, משוב ו\'קפיצת\' עמוד.
4.לכל תשובה יכול להיות קטע טקסט קצר שמוצג אם וכאשר התשובה נבחרת. קטע הטקסט נקרא **תגובה**.
5.- בנוסף לכך, לכל תשובה מותאמת **\'קפיצה\'**. ה\'קפיצה\' יכולה להיות יחסית - לעמוד הזה, לעמוד הבא - או מוחלטת - מציינת כל אחד מהעמודים בשיעור או את סוף השיעור.
6.לפי ברירת המחדל, התשובה הראשונה \'קופצת\' ל**עמוד הבא** בשיעור. התשובות שעוקבות אחריה, \'קופצות\' לאותו עמוד שבו הן נמצאות. כלומר, אם הסטודנט לא בוחר בתשובה הראשונה, הוא כל הזמן חוזר לאותו העמוד בשיעור. אם כבר יצרתם אשכול (יחידה לאחסון נתונים) בעל \'סוף אשכול\', והשאלה נמצאת בתוכו, אתם יכולים לבחור בנוסף לקפוץ לשאלת "אנסין" בתוך האשכול. אפשרות זו לא תוצג אם אתם לא נמצאים בתוך אשכול. אתם יכולים להקיף מערכת של שאלות באשכול וב\'סוף אשכול\' בכל עת.
7.העמוד הבא נקבע על ידי **הסדר הלוגי** של השיעור. זהו סדר העמודים כפי שהמורה רואה אותם. את הסדר הזה ניתן לשנות על ידי הזזה של עמודים בתוך השיעור.
8.לשיעור ישנו גם **סדר ניווט**. זהו סדר העמודים, כפי שהסטודנטים רואים אותם.
סדר זה נקבע על ידי ה\'קפיצות\' שמוגדרות לשאלות פרטניות, והוא יכול להיות שונה ביותר מהסדר הלוגי, אלא אם כן, \*לא\* משנים את ערכי ה\'קפיצות\' ומשאירים אותם לפי ערכי ברירת המחדל (השניים קשורים באדיקות אחד לשני). בידי המורה האפשרות לבדוק את סדר הניווט.
9.לרוב, כאשר התשובות מוצגות בפני הסטודנטים, הן מעורבבות. כלומר, התשובה הראשונה בתצוגה של המורה, לאוו דווקא תהיה התשובה שתופיע ראשונה ברשימה שמוצגת לסטודנטים. (יתרה מזאת, רוב הסיכויים שאותו סט של שאלות יופיע בסדר אחר בכל פעם שהוא מוצג). יוצאות מן הכלל הן מערכות של תשובות לשאלות התאמה, כאן, התשובות מופיעות באותו הסדר שהמורה הכניס אותן.
10. מספר התשובות יכול להישתנות מעמוד לעמוד. לדוגמא, מותר שעמודים מסויימים יסתיימו בשאלת נכוןלא נכון, בזמן שאחרים יסתיימו בשאלות בעלות תשובה אחת נכונה, ובו נאמר, שלוש הסחות דעת (שאלות אמריקאיות).
11. ניתן להגדיר עמוד ללא תשובות כלל. בפני הסטודנטים מוצג קישור **המשך** במקום סט של תשובות.
12. אם לא הפעלתם שיטה להשגת נקודות מותאמת אישית: למטרת נתינת ציון לשיעורים, תשובות **נכונות** הן התשובות ש\'קופצות\' לעמוד שנמצא \*למטה\* מהעמוד הנוכחי בסדר הלוגי.
תשובות **לא נכונות**, הן אלו ש\'קופצות\' או, לאותו העמוד או, לעמוד שנמצא \*למעלה\* מהעמוד הנוכחי בסדר הלוגי. כך שאם אתם \*לא\* משנים את ה\'קפיצות\', התשובה הראשונה היא התשובה הנכונה, ושאר התשובות הן תשובות לא נכונות.
אם הפעלתם שיטה להשגת נקודות בהתאמה אישית: מתן ציון לתשובה נקבע לפי ערך הנקודות של התשובה, כאשר כלל הנקודות שהורווחו משמש כמקטע מכלל ערך הנקודות של השיעור, עד ל100%.
13. יכול להיות שלשאלות יהיו מספר תשובות נכונות (ולא רק תשובה נכונה אחת). לדוגמא, אם ישנן שתי תשובות ש\'קופצות\' לעמוד הבא, אז כל אחת מהן נחשבת כתשובה נכונה. (למרות שעמוד היעד של שתי התשובות הוא זהה, התגובות שמוצגות עבור שתי התשובות בפני הסטודנטים בדרך לעמוד היעד יכולות להיות שונות.)
* בתצוגת השיעור של המורה, התשובות הנכונות מופיעות עם תווית \'תשובה\', מודגשת בקו תחתון.
\* **|טבלאות הסתעפות** הינן פשוט עמודים בעלי מערכת של קישורים לעמודים אחרים בשיעור. למשל הגיוני ששיעור יתחיל בטבלת הסתעפויות שמתנהגת כמו **תוכן עניינים**.
* לכל קישור בטבלת ההסתעפויות יש שני מרכיבים, תיאור וכותרת של העמוד אליו הוא \'קופץ\'.
* טבלת הסתעפויות מחלקת ביעילות את השיעור למספר **הסתעפויות** (או חלקים).
על כל הסתעפות להכיל מספר עמודים (שכולם, כנראה, קשורים לאותו הנושא). סוף ההסתעפות לרוב מסומנת על ידי עמוד **סוף הסתעפות**. זהו עמוד מיוחד, שלפי ברירת מחדל, מחזיר את הסטודנטים חזרה לטבלת ההסתעפויות שקודמת לו.
(אם יש בכך צורך, ניתן לשנות את \'קפיצת\' ה"חזור" בסוף ההסתעפות, וזאת על ידי עריכת העמוד.)
* בשיעור יכולה להיות יותר מטבלת הסתעפויות אחת. לדוגמא, ניתן לבנות שיעור כך שנקודות מומחיות ימוקמו כתת-הסתעפויות בתוך ענפי הנושא העיקריים.
* זה חשוב לספק לסטודנטים את האמצעים לסיים את השיעור. את זה ניתן לעשות על ידי הוספת קישור "סיים את השיעור" בטבלת ההסתעפויות העיקרית. קישור זה \'קופץ\' לעמוד (הדמיוני) **סוף השיעור**.
אפשרות אחרת היא שההסתעפות האחרונה בשיעור (כאן המילה "אחרון" משמשת במובן של הסדר הלוגי),
פשוט תמשיך לסוף השיעור, כלומר, השיעור \*לא\* יסתיים על ידי עמוד \'סוף הסתעפות\'.
* כאשר לא מופעלת שיטה להשגת נקודות בהתאמה אישית, וכאשר בשיעור יש טבלת הסתעפויות אחת או יותר, מומלץ לקבוע את פרמטר "מספר השאלות המינמלי" לערך הגיוני כלשהוא. פרמטר זה קובע גבול נמוך יותר למספר העמודים שמוצגים בזמן חישוב הציון. ללא הפרמטר הזה, סטודנט יכול לבקר בהסתעפות אחת בלבד בשיעור, לענות על כל השאלות נכונה, לעזוב את השיעור ועדיין לקבל עליו את הציון המירבי.
כאשר השיטה להשגת נקודות בהתאמה אישית מופעלת, לסטודנט ניתן ציון על בסיס היות מספר הנקודות שהוא צבר אחוז מתוך כלל הנקודות של השיעור.
* בנוסף לכך, כאשר לא מופעלת שיטה להשגת נקודות בהתאמה אישית, ויש טבלת הסתעפויות, בידי הסטודנט האפשרות לחזור ולבקר באותה הסתעפות יותר מפעם אחת. אך הציון מחושב על ידי מספר השאלות \*הייחודיות\* שנענו.
כך נתינה חוזרת ונשנית של תשובות לאותן השאלות, \*לא\* מעלה את הציון. (למעשה, ההפך הוא הנכון, היא מורידה את הציון מכיוון שמספר העמודים שנראו על ידי הסטודנט משמש כמכנה כשמחשבים את הציונים, והספירה כוללת בחובה עמודים שחוזרים על עצמם). כדי לתת לסטודנטים מושג כללי על ההתקדמות שלהם בשיעור, מציגים בפניהם את הפרטים הבאים, בכל עמוד טבלת הסתעפויות: על כמה שאלות הם ענו נכונה, מספר העמודים שהם ראו, והציון הנוכחי שלהם.
כאשר השיטה להשגת נקודות בהתאמה אישית מופעלת, הסטודנט יכול לחזור לשאלה לאחר שהוא כבר ראה אותה אם נתיב הניווט מאפשר זאת, וכך לזכות בנקודות של השאלה הזאת, אם (מספר ה) \'נסיונות\' גדול מ 1. כדי למנוע את זה, קבעו את (מספר) ה\'נסיונות\' ל 1.
* ל**סוף השיעור** ניתן להגיע על ידי \'קפיצה\' ישירה למיקום שלו, או על ידי \'קפיצה\' מהעמוד האחרון (הלוגי) של השיעור, לעמוד הבא אחריו. כאשר לא מופעלת השיטה להשגת נקודות בהתאמה אישית, כאשר מגיעים לסוף השיעור, הסטודנט מקבל הודעת איחולים ונגלה בפניו הציון שלו. הציון מורכב מ: (מספר השאלות עליהן הוא ענה נכונה מספר העמודים שהוא ראה) * הציון של השיעור.
כאשר השיטה להשגת נקודות בהתאמה אישית מופעלת, הציון מורכב מהנקודות שהסטודנט הרוויח, כ% (אחוז) מתוך כלל הנקודות. (לדוגמא, הסטודנט הרוויח 3 נקודות בשיעור של 3 נקודות = 100% של 3 נקודות).
* אם הסטודנט מחליט לעזוב את השיעור באמצע, ולכן הוא \*לא\* מגיע לסוף השיעור, כאשר הוא מחליט להיכנס בחזרה לשיעור ניתנת לו אפשרות הבחירה הבאה: הוא יכול להתחיל את השיעור מההתחלה, או שהוא יכול להתחיל את השיעור מהשאלה האחרונה עליה הוא ענה נכונה.
* בשיעור שמאפשר נסיונות חוזרים, המורה יכול לבחור בין אם להשתמש בציון הטוב ביותר או בממוצא של הציונים כציון ה"סופי" של השיעור.
* עמודי אשכול: אשכול מייצג סט של שאלות, שמתוכן ניתן לבחור שאלה אחת או יותר באופן שרירותי. על מנת לקבל את התוצאות הטובות ביותר, את האשכולים יש לסיים עם עמוד \'סוף אשכול\' (אחרת הם מתייחסים לעמוד סוף השיעור כסוף האשכול). שאלות מתוך האשכול ניתן לבחור באופן שרירותי על ידי שימוש ב"שאלה שרירותית מתוך אשכול" כ\'קפיצה\'. שאלות מתוך האשכול ניתן לקשר לסוף האשכול על מנת לצאת מהאשכול, או ניתן לקשר אותם ל\'קפוץ\' לשאלת "אנסין" בתוך הקלסר, או לכל עמוד אחר בשיעור. דבר שמאפשר יצירה של תרחישים עם מרכיב שרירותי באמצעות פרק השיעור.
</ol>';
$string['page'] = 'עמוד: {$a}';
$string['page-mod-lesson-edit'] = 'עריכת עמוד השיעור';
$string['page-mod-lesson-view'] = 'צפיה ותצוגה של עמוד השיעור';
$string['page-mod-lesson-x'] = 'עמוד שיעור כלשהו';
$string['pagecontents'] = 'תכולת העמוד';
$string['pages'] = 'עמודים';
$string['pagetitle'] = 'כותרת העמוד';
$string['password'] = 'סיסמה';
$string['passwordprotectedlesson'] = '{$a} הינו שיעור שמוגן על ידי סיסמה.';
$string['pleasecheckoneanswer'] = 'אנא סמן תשובה אחת';
$string['pleasecheckoneormoreanswers'] = 'אנא סמן תשובה אחת, או יותר.';
$string['pleaseenteryouranswerinthebox'] = 'אנא הקלד את התשובה שלך בקופסא.';
$string['pleasematchtheabovepairs'] = 'אנא התאם בין הזוגות שמופיעים לעיל.';
$string['pluginadministration'] = 'ניהול פעילות השיעור';
$string['pluginname'] = 'שיעור';
$string['pointsearned'] = 'נקודות שהורווחו';
$string['postprocesserror'] = 'שגיאה התרחשה בזמן post-processing!';
$string['postsuccess'] = 'פרסם את המצליחים';
$string['pptsuccessfullimport'] = 'יבוא העמודים מהמצגת ה- PowerPoint  שהועלת התבצע בהצלחה';
$string['practice'] = 'תרגול';
$string['practice_help'] = '**שיעור לתרגול**
שיעור לתרגול לא יופיע בגיליון הציונים.';
$string['preprocesserror'] = 'שגיאה התרחשה בזמן pre-processing!';
$string['preview'] = 'תצוגה מקדימה';
$string['previewlesson'] = 'הצגה מוקדמת של {$a}';
$string['previouspage'] = 'עמוד קודם';
$string['processerror'] = 'שגיאה התרחשה במהלך העיבוד';
$string['progressbar'] = 'סרגל התקדמות';
$string['progressbar_help'] = '**סרגל התקדמות**
הצג סרגל התקדמות בתחתית השיעור. כרגע, סרגל התקדמות זה מציג באופן הכי מדוייק את ההתקדמות הנעשית בשיעור הליניארי.
כדי לחשב איזה אחוז מהשיעור התלמיד כבר עשה, הסרגל מתייחס לטבלאות ההסתעפות ועמודי השאלות שנענו נכונה, כסימני התקדמות בשיעור.
במהלך חישוב המספר הכולל של עמודים בשיעור, אשכולים (יחידות לאחסון נתונים), ועמודים בעלי אשכולים נחשבים כעמוד אחד בלבד, בזמן שעמודי \'סוף אשכול\' ו\'סוף טבלת הסתעפות\' לא נספרים כלל. כל שאר העמודים נחשבים במספר הכולל של העמודים בשיעור.
שימו לב: הסגנונות שמוצעים בברירת המחדל לסרגל ההתקדמות הם לא מרשימים (; את כל הסגנונות (כלומר: צבעים, תמונות רקע, וכו\') בסרגל ההתקדמות, ניתן לשנות ב mod/lesson/styles.php.';
$string['progressbarteacherwarning'] = 'לא ניתן להציג סרגל התקדמות עבור {$a}';
$string['progressbarteacherwarning2'] = 'לא  תוכל לראות את סרגל ההתקדמות מפני שאתה יכול לערוך את שיעור זה';
$string['progresscompleted'] = 'השלמו {$a}% מהשיעור';
$string['qtype'] = 'סוג עמוד';
$string['question'] = 'שאלה';
$string['questionoption'] = 'שאלה';
$string['questiontype'] = 'סוג שאלה';
$string['randombranch'] = 'דף תוכן מסתעף שרירותי';
$string['randompageinbranch'] = 'שאלה שרירותית בתוך הסתעפות';
$string['rank'] = 'דרגה';
$string['rawgrade'] = 'ציון גולמי';
$string['receivedcredit'] = 'נקודות שהתקבלו';
$string['redisplaypage'] = 'הצג מחדש את העמוד';
$string['report'] = 'דוח';
$string['reports'] = 'דוחות';
$string['response'] = 'תגובה';
$string['retakesallowed'] = 'נסיונות חוזרים מאופשרים';
$string['retakesallowed_help'] = '**אפשר לסטודנטים לחזור על השיעור**
הגדרה זו קובעת האם הסטודנטים יוכלו לחזור על השיעור יותר מפעם אחת, או פעם אחת בלבד.
המורה יכול להחליט שהשיעור מכיל תוכן שהסטודנטים צריכים להכיר לעומק. במקרה כזה, צריך לאפשר צפיה חוזרת בשיעור. אך במידה והחומר משמש יותר כמעין מבחן, לא צריך לאפשר חזרה על השיעור.

כשלסטודנטים ניתנת האפשרות לחזור שנית על השיעור, ה**ציונים** שמוצגים בעמוד הציונים יכולים להיות או, הציון ה**ממוצע** של כל הניסיונות החוזרים שלהם, או הציון ה**טוב ביותר** שהם קיבלו עבור השיעור. הפרמטר הבא קובע באיזו משתי הדרכים החלופיות הללו יחושב הציון.

שימו לב שב**ניתוח השאלות**תמיד נבחנות התשובות מהניסיונות הראשונים של הסטודנטים, התשובות מניסיונות חוזרים שבאים לאחר מכן, לא נחשבות.
לפי ברירת המחדל, אפשרות זו היא **לא**, כלומר הסטודנטים לא יכולים לחזור על השיעור.
זה מצופה שאפשרות זו תכוון **כן** רק בנסיבות יוצאות דופן.';
$string['returnto'] = 'חזור ל-{$a}';
$string['returntocourse'] = 'חזור לקורס';
$string['review'] = 'סקור';
$string['reviewlesson'] = 'סקור את השיעור';
$string['reviewquestionback'] = 'כן, הייתי רוצה לנסות בשנית';
$string['reviewquestioncontinue'] = 'לא, אני רוצה להמשיך לשאלה הבאה';
$string['sanitycheckfailed'] = 'לא עבר את בדיקת שפיות הדעת: ניסיון זה נמחק.';
$string['savechanges'] = 'שמירת שינויים';
$string['savechangesandeol'] = 'שמירת כל השינויים ומעבר לסוף השיעור.';
$string['savepage'] = 'שמירת העמוד.';
$string['score'] = 'תוצאה';
$string['scores'] = 'תוצאות';
$string['secondpluswrong'] = 'לא בדיוק. תרצה לנסות שוב?';
$string['selectaqtype'] = 'בחר בסוג השאלות';
$string['shortanswer'] = 'תשובה קצרה';
$string['showanunansweredpage'] = 'הראה עמוד שלא נענה';
$string['showanunseenpage'] = 'הראה עמוד עם שאלת אנסין';
$string['singleanswer'] = 'תשובה יחידה';
$string['skip'] = 'פסח על הניווט.';
$string['slideshow'] = 'מצגת שקופיות';
$string['slideshow_help'] = '**מצגת שקפים**
אפשרות זו מאפשרת להציג את השיעור כמצגת בה הגובה והרוחב קבועים מראש, וצבע הרקע מותאם אישית.
אם תוכן העמוד עובר את גבול המצגת, יופיע סרגל גלילה לגובה או לרוחב (המסך) שמבוסס על CSS. שאלות \'ישברו\' את מצב המצגת, לפי ברירת מחדל רק העמודים (טבלאות הסתעפות) יוצגו כמצגת. כפתורים שמתוייגים לפי שפת ברירת המחדל כ"הלאה" ו"חזרה" יופיעו בקצה הימני ובקצה השמאלי של השקופית, במידה ואפשרות זו נבחרת בעמוד. כפתורים אחרים ימוקמו יחדיו מתחת לאמצע השקופית.';
$string['slideshowbgcolor'] = 'צבע הרקע של מצגת השקופיות';
$string['slideshowheight'] = 'גובה מצגת השקופיות';
$string['slideshowwidth'] = 'רוחב מצגת השקופיות';
$string['startlesson'] = 'התחל את השיעור';
$string['studentattemptlesson'] = 'ניסיון מספר {$a->attempt}, של {$a->lastname}, {$a->firstname}';
$string['studentname'] = '{$a} שם';
$string['studentoneminwarning'] = 'אזהרה: יש לך דקה אחת או פחות כדי לסיים את השיעור.';
$string['studentresponse'] = 'התגובות של {$a}';
$string['submit'] = 'הגש';
$string['submitname'] = 'הגש שם';
$string['teacherjumpwarning'] = 'שיעור זה משתמש בקפיצת {$a->cluster} או בקפיצת {$a->unseen}. במקום זה, יעשה שימוש בקפיצת \'העמוד הבא\'. התחבר כסטודנט על מנת לבחון את הקפיצות הללו.';
$string['teacherongoingwarning'] = 'תוצאה מצטברת מוצגת רק בפני הסטודנט. התחבר כסטודנט כדי לבחון את התוצאה המתמשכת.';
$string['teachertimerwarning'] = 'שעון העצר עובד רק לסטודנטים. התחבר כסטודנט כדי לבחון את שעון העצר.';
$string['thatsthecorrectanswer'] = 'זוהי התשובה הנכונה.';
$string['thatsthewronganswer'] = 'זוהי לא התשובה הנכונה.';
$string['thefollowingpagesjumptothispage'] = 'העמודים הבאים קופצים לעמוד זה.';
$string['thispage'] = 'עמוד זה.';
$string['timeremaining'] = 'הזמן שנשאר';
$string['timespenterror'] = 'עליך להעביר לפחות {$a} דקות בשיעור זה.';
$string['timespentminutes'] = 'הזמן שעבר (בדקות)';
$string['timetaken'] = 'זמן שנלקח';
$string['topscorestitle'] = '{$a} התוצאות הגבוהות ביותר.';
$string['truefalse'] = 'נכון/שגוי';
$string['unabledtosavefile'] = 'הקובץ שהעלאת לא ניתן לשמירה';
$string['unknownqtypesnotimported'] = 'לא היה ניתן לייבא{$a} שאלות עם סוגי שאלה שלא נתמכים';
$string['unseenpageinbranch'] = 'שאלת אנסין בתוך ההסתעפות';
$string['unsupportedqtype'] = 'סוג שאלה לא נתמך ({$a})!';
$string['updatedpage'] = 'עמוד מעודכן';
$string['updatefailed'] = 'עדכון נכשל';
$string['usemaximum'] = 'השתמש במקסימום';
$string['usemean'] = 'השתמש בממוצע';
$string['usepassword'] = 'שיעור המוגן על-ידי סיסמה';
$string['usepassword_help'] = '**שיעור המוגן על ידי סיסמא**
אפשרות זו תיתן לסטודנט גישה לשיעור רק במידה והוא הקליד את הסיסמא.';
$string['viewgrades'] = 'ראה ציונים';
$string['viewhighscores'] = 'ראה את רשימת התוצאות הגבוהות';
$string['viewreports'] = 'ראה {$a->attempts} שהושלמו {$a->student} נסיונות.';
$string['viewreports2'] = 'צפה ב- {$a} נסיונות שהושלמו';
$string['welldone'] = 'כל הכבוד!';
$string['whatdofirst'] = 'מה תרצה לעשות קודם?';
$string['wronganswerjump'] = 'קפיצה של תשובה לא נכונה.';
$string['wronganswerscore'] = 'תוצאה של תשובה לא נכונה.';
$string['wrongresponse'] = 'תגובה של תשובה לא נכונה.';
$string['xattempts'] = 'נסיונות';
$string['youhaveseen'] = 'כבר ראית יותר מעמוד אחד בשיעור זה.<br />האם תרצה להתחיל בעמוד האחרון שראית?';
$string['youmadehighscore'] = 'נכנסת לרשימת {$a} התוצאות הגבוהות ביותר.';
$string['youranswer'] = 'התשובה שלך';
$string['yourcurrentgradeis'] = 'הציון הנוכחי שלך הוא {$a}';
$string['yourcurrentgradeisoutof'] = 'הציון הנוכחי שלך הוא {$a->grade} מתוך {$a->total}.';
$string['youshouldview'] = 'על התשובה שלך להיות לפחות: {$a}';
